{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<START>": 3,
  "<END>": 4,
  "<UNK>": 5,
  "START_RH_H15": 6,
  "START_LH_H15": 7,
  "START_LH_H5": 8,
  "START_RH_H16": 9,
  "START_RH_H5": 10,
  "START_RH_H6": 11,
  "START_LH_H14": 12,
  "START_LH_H6": 13,
  "START_LH_H4": 14,
  "START_RH_H7": 15,
  "START_LH_H16": 16,
  "START_RH_H18": 17,
  "START_RH_H4": 18,
  "START_LH_H3": 19,
  "START_LH_H17": 20,
  "RH_H40": 21,
  "START_RH_H17": 22,
  "LH_H37": 23,
  "LH_H36": 24,
  "RH_H39": 25,
  "START_RH_H3": 26,
  "RH_H61": 27,
  "LH_H48": 28,
  "START_LH_H18": 29,
  "RH_H41": 30,
  "LH_H35": 31,
  "LH_H58": 32,
  "RH_H72": 33,
  "START_LH_H7": 34,
  "LH_H143": 35,
  "LH_H79": 36,
  "RH_H52": 37,
  "RH_H73": 38,
  "RH_H63": 39,
  "LH_H59": 40,
  "START_RH_H14": 41,
  "LH_H91": 42,
  "LH_H80": 43,
  "RH_H28": 44,
  "RH_H38": 45,
  "RH_H140": 46,
  "RH_H51": 47,
  "RH_H159": 48,
  "LH_H47": 49,
  "LH_H104": 50,
  "RH_H93": 51,
  "RH_H128": 52,
  "LH_H57": 53,
  "RH_H139": 54,
  "LH_H105": 55,
  "LH_H69": 56,
  "RH_H153": 57,
  "RH_H27": 58,
  "RH_H29": 59,
  "RH_H71": 60,
  "RH_H116": 61,
  "LH_H126": 62,
  "RH_H106": 63,
  "LH_H45": 64,
  "LH_H103": 65,
  "LH_H49": 66,
  "LH_H26": 67,
  "RH_H115": 68,
  "RH_H192": 69,
  "LH_H82": 70,
  "RH_H50": 71,
  "LH_H112": 72,
  "LH_H38": 73,
  "RH_H83": 74,
  "LH_H149": 75,
  "LH_H135": 76,
  "RH_H104": 77,
  "LH_H70": 78,
  "LH_H25": 79,
  "RH_H60": 80,
  "LH_H68": 81,
  "RH_H95": 82,
  "RH_H147": 83,
  "LH_H102": 84,
  "RH_H81": 85,
  "LH_H46": 86,
  "LH_H27": 87,
  "RH_H170": 88,
  "LH_H147": 89,
  "LH_H156": 90,
  "RH_H97": 91,
  "RH_H136": 92,
  "LH_H145": 93,
  "LH_H121": 94,
  "LH_H122": 95,
  "LH_H125": 96,
  "LH_H92": 97,
  "RH_H49": 98,
  "LH_H101": 99,
  "LH_H133": 100,
  "LH_H71": 101,
  "RH_H94": 102,
  "RH_H48": 103,
  "RH_H131": 104,
  "LH_H190": 105,
  "LH_H81": 106,
  "RH_H150": 107,
  "RH_H59": 108,
  "RH_H108": 109,
  "LH_H116": 110,
  "LH_H136": 111,
  "RH_H175": 112,
  "LH_H110": 113,
  "LH_H72": 114,
  "RH_H193": 115,
  "RH_H126": 116,
  "RH_H82": 117,
  "RH_H92": 118,
  "LH_H114": 119,
  "LH_H167": 120,
  "RH_H70": 121,
  "LH_H159": 122,
  "LH_H39": 123,
  "LH_H90": 124,
  "RH_H84": 125,
  "RH_H196": 126,
  "RH_H164": 127,
  "LH_H60": 128,
  "LH_H193": 129,
  "RH_H37": 130,
  "RH_H125": 131,
  "RH_H118": 132,
  "RH_H161": 133,
  "RH_H62": 134,
  "LH_H113": 135,
  "RH_H114": 136,
  "RH_H191": 137,
  "RH_H160": 138,
  "LH_H66": 139,
  "LH_H191": 140,
  "LH_H93": 141,
  "RH_H127": 142,
  "LH_H123": 143,
  "RH_H138": 144,
  "LH_H100": 145,
  "LH_H192": 146,
  "RH_H135": 147,
  "RH_H105": 148,
  "LH_H188": 149,
  "RH_H107": 150,
  "LH_H146": 151,
  "RH_H74": 152,
  "RH_H130": 153,
  "LH_H171": 154,
  "LH_H181": 155,
  "RH_H117": 156,
  "RH_H85": 157,
  "LH_H168": 158,
  "LH_H127": 159,
  "RH_H142": 160,
  "LH_H61": 161,
  "LH_H83": 162,
  "RH_H86": 163,
  "RH_H103": 164,
  "RH_H173": 165,
  "LH_H160": 166,
  "RH_H109": 167,
  "RH_H171": 168,
  "LH_H144": 169,
  "RH_H75": 170,
  "LH_H67": 171,
  "LH_H88": 172,
  "LH_H111": 173,
  "LH_H124": 174,
  "LH_H148": 175,
  "LH_H169": 176,
  "RH_H119": 177,
  "LH_H115": 178,
  "LH_H99": 179,
  "LH_H50": 180,
  "RH_H141": 181,
  "LH_H187": 182,
  "LH_H179": 183,
  "LH_H158": 184,
  "LH_H138": 185,
  "LH_H137": 186,
  "RH_H148": 187,
  "RH_H91": 188,
  "LH_H165": 189,
  "RH_H42": 190,
  "LH_H150": 191,
  "LH_H157": 192,
  "LH_H189": 193,
  "RH_H87": 194,
  "RH_H182": 195,
  "RH_H194": 196,
  "RH_H64": 197,
  "LH_H177": 198,
  "RH_H113": 199,
  "RH_H174": 200,
  "RH_H158": 201,
  "LH_H56": 202,
  "LH_H78": 203,
  "RH_H47": 204,
  "LH_H94": 205,
  "LH_H134": 206,
  "RH_H30": 207,
  "RH_H137": 208,
  "RH_H183": 209,
  "RH_H102": 210,
  "LH_H62": 211,
  "RH_H96": 212,
  "RH_H151": 213,
  "RH_H36": 214,
  "RH_H120": 215,
  "RH_H26": 216,
  "RH_H184": 217,
  "RH_H124": 218,
  "RH_H53": 219,
  "RH_H152": 220,
  "RH_H162": 221,
  "LH_H77": 222,
  "RH_H90": 223,
  "RH_H98": 224,
  "RH_H149": 225,
  "LH_H161": 226,
  "LH_H89": 227,
  "RH_H172": 228,
  "LH_H84": 229,
  "LH_H24": 230,
  "RH_H76": 231,
  "LH_H28": 232,
  "RH_H80": 233,
  "RH_H181": 234,
  "LH_H182": 235,
  "LH_H166": 236,
  "LH_H139": 237,
  "RH_H197": 238,
  "LH_H154": 239,
  "RH_H186": 240,
  "RH_H58": 241,
  "LH_H155": 242,
  "RH_H129": 243,
  "RH_H169": 244,
  "LH_H95": 245,
  "LH_H106": 246,
  "RH_H157": 247,
  "RH_H185": 248,
  "RH_H163": 249,
  "LH_H132": 250,
  "RH_H54": 251,
  "RH_H146": 252,
  "LH_H117": 253,
  "LH_H170": 254,
  "RH_H195": 255,
  "RH_H65": 256,
  "RH_H180": 257,
  "LH_H194": 258,
  "LH_H34": 259,
  "RH_H190": 260,
  "LH_H178": 261,
  "RH_H189": 262,
  "RH_H168": 263,
  "LH_H172": 264,
  "LH_H40": 265,
  "RH_H69": 266,
  "LH_H176": 267,
  "LH_H44": 268,
  "LH_H55": 269,
  "LH_H180": 270,
  "LH_H73": 271,
  "LH_H51": 272,
  "RH_H43": 273,
  "LH_H183": 274,
  "RH_H145": 275,
  "LH_H118": 276,
  "LH_H128": 277,
  "LH_H195": 278,
  "RH_H134": 279,
  "RH_H101": 280,
  "RH_H123": 281,
  "LH_H29": 282,
  "RH_H179": 283,
  "LH_H151": 284,
  "LH_H74": 285,
  "LH_H23": 286,
  "LH_H129": 287,
  "RH_H79": 288,
  "RH_H156": 289,
  "LH_H33": 290,
  "RH_H112": 291,
  "RH_H25": 292,
  "LH_H196": 293,
  "LH_H140": 294,
  "LH_H85": 295,
  "START_LH_H2": 296,
  "RH_H188": 297,
  "LH_H162": 298,
  "RH_H178": 299,
  "RH_H68": 300,
  "LH_H184": 301,
  "LH_H107": 302,
  "RH_H46": 303,
  "RH_H167": 304,
  "LH_H15": 305,
  "RH_H35": 306,
  "RH_H18": 307,
  "RH_H122": 308,
  "LH_H173": 309,
  "LH_H52": 310,
  "LH_H63": 311,
  "RH_H166": 312,
  "LH_H96": 313,
  "LH_H41": 314,
  "LH_H141": 315,
  "START_RH_H19": 316,
  "RH_H57": 317,
  "RH_H31": 318,
  "LH_H130": 319,
  "RH_H133": 320,
  "RH_H32": 321,
  "LH_H174": 322,
  "LH_H163": 323,
  "LH_H16": 324,
  "RH_H111": 325,
  "START_LH_H13": 326,
  "RH_H67": 327,
  "LH_H97": 328,
  "START_RH_H8": 329,
  "LH_H197": 330,
  "LH_H119": 331,
  "RH_H155": 332,
  "LH_H152": 333,
  "RH_H56": 334,
  "LH_H14": 335,
  "LH_H185": 336,
  "RH_H24": 337,
  "LH_H17": 338,
  "RH_H16": 339,
  "RH_H177": 340,
  "LH_H108": 341,
  "LH_H22": 342,
  "RH_H78": 343,
  "RH_H17": 344,
  "LH_H86": 345,
  "RH_H154": 346,
  "RH_H100": 347,
  "RH_H144": 348,
  "LH_H164": 349,
  "LH_H75": 350,
  "RH_H187": 351,
  "LH_H109": 352,
  "LH_H13": 353,
  "LH_H30": 354,
  "LH_H142": 355,
  "RH_H19": 356,
  "LH_H42": 357,
  "RH_H89": 358,
  "RH_H45": 359,
  "LH_H64": 360,
  "RH_H15": 361,
  "LH_H53": 362,
  "LH_H43": 363,
  "RH_H34": 364,
  "LH_H31": 365,
  "RH_H176": 366,
  "RH_H165": 367,
  "LH_H87": 368,
  "RH_H143": 369,
  "RH_H121": 370,
  "LH_H153": 371,
  "RH_H99": 372,
  "RH_H66": 373,
  "RH_H132": 374,
  "RH_H20": 375,
  "LH_H131": 376,
  "LH_H19": 377,
  "LH_H175": 378,
  "LH_H54": 379,
  "LH_H12": 380,
  "LH_H120": 381,
  "RH_H55": 382,
  "RH_H23": 383,
  "LH_H65": 384,
  "LH_H186": 385,
  "LH_H11": 386,
  "LH_H76": 387,
  "RH_H110": 388,
  "RH_H44": 389,
  "RH_H77": 390,
  "LH_H98": 391,
  "RH_H88": 392,
  "LH_H18": 393,
  "RH_H21": 394,
  "RH_H33": 395,
  "RH_H14": 396,
  "RH_H22": 397,
  "RH_H13": 398,
  "LH_H32": 399,
  "LH_H20": 400,
  "RH_H11": 401,
  "RH_H12": 402,
  "LH_H21": 403
}