{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<START>": 3,
  "<END>": 4,
  "<UNK>": 5,
  "START_RH_H40": 6,
  "START_RH_H41": 7,
  "START_LH_H27": 8,
  "START_LH_H26": 9,
  "START_RH_H37": 10,
  "START_RH_H28": 11,
  "START_LH_H39": 12,
  "START_LH_H37": 13,
  "START_LH_H28": 14,
  "START_LH_H35": 15,
  "START_RH_H29": 16,
  "START_LH_H38": 17,
  "START_LH_H25": 18,
  "START_RH_H39": 19,
  "START_RH_H38": 20,
  "START_RH_H27": 21,
  "LH_H59": 22,
  "START_RH_H26": 23,
  "RH_H61": 24,
  "START_LH_H40": 25,
  "RH_H62": 26,
  "LH_H71": 27,
  "LH_H72": 28,
  "RH_H96": 29,
  "START_LH_H36": 30,
  "LH_H61": 31,
  "START_RH_H30": 32,
  "RH_H72": 33,
  "LH_H115": 34,
  "RH_H73": 35,
  "LH_H60": 36,
  "LH_H69": 37,
  "LH_H83": 38,
  "RH_H116": 39,
  "RH_H71": 40,
  "RH_H84": 41,
  "RH_H130": 42,
  "LH_H62": 43,
  "RH_H108": 44,
  "RH_H85": 45,
  "RH_H93": 46,
  "START_LH_H24": 47,
  "RH_H63": 48,
  "RH_H51": 49,
  "RH_H119": 50,
  "START_RH_H36": 51,
  "RH_H74": 52,
  "LH_H90": 53,
  "RH_H105": 54,
  "RH_H70": 55,
  "RH_H83": 56,
  "START_LH_H29": 57,
  "RH_H141": 58,
  "RH_H59": 59,
  "RH_H60": 60,
  "RH_H95": 61,
  "LH_H100": 62,
  "LH_H105": 63,
  "RH_H69": 64,
  "RH_H117": 65,
  "LH_H95": 66,
  "LH_H68": 67,
  "LH_H48": 68,
  "LH_H49": 69,
  "LH_H139": 70,
  "RH_H161": 71,
  "LH_H81": 72,
  "LH_H70": 73,
  "LH_H92": 74,
  "RH_H64": 75,
  "RH_H163": 76,
  "RH_H97": 77,
  "LH_H102": 78,
  "LH_H82": 79,
  "RH_H50": 80,
  "LH_H58": 81,
  "RH_H92": 82,
  "LH_H93": 83,
  "LH_H94": 84,
  "RH_H129": 85,
  "LH_H73": 86,
  "LH_H134": 87,
  "RH_H131": 88,
  "LH_H158": 89,
  "LH_H116": 90,
  "LH_H124": 91,
  "LH_H122": 92,
  "RH_H150": 93,
  "RH_H107": 94,
  "LH_H104": 95,
  "LH_H133": 96,
  "RH_H148": 97,
  "LH_H112": 98,
  "RH_H75": 99,
  "LH_H67": 100,
  "START_RH_H25": 101,
  "LH_H114": 102,
  "RH_H126": 103,
  "LH_H57": 104,
  "RH_H58": 105,
  "RH_H104": 106,
  "LH_H135": 107,
  "LH_H56": 108,
  "LH_H89": 109,
  "RH_H115": 110,
  "LH_H47": 111,
  "LH_H147": 112,
  "LH_H111": 113,
  "RH_H140": 114,
  "LH_H91": 115,
  "RH_H68": 116,
  "LH_H103": 117,
  "RH_H118": 118,
  "LH_H125": 119,
  "START_RH_H42": 120,
  "RH_H81": 121,
  "RH_H103": 122,
  "LH_H78": 123,
  "RH_H94": 124,
  "RH_H149": 125,
  "RH_H49": 126,
  "RH_H86": 127,
  "RH_H137": 128,
  "START_LH_H34": 129,
  "RH_H109": 130,
  "RH_H127": 131,
  "LH_H79": 132,
  "LH_H127": 133,
  "RH_H138": 134,
  "RH_H128": 135,
  "LH_H160": 136,
  "RH_H52": 137,
  "LH_H156": 138,
  "LH_H159": 139,
  "LH_H126": 140,
  "LH_H106": 141,
  "RH_H135": 142,
  "LH_H157": 143,
  "RH_H120": 144,
  "LH_H118": 145,
  "LH_H46": 146,
  "LH_H84": 147,
  "RH_H164": 148,
  "LH_H138": 149,
  "RH_H174": 150,
  "RH_H106": 151,
  "RH_H162": 152,
  "RH_H82": 153,
  "LH_H144": 154,
  "LH_H136": 155,
  "START_RH_H31": 156,
  "LH_H155": 157,
  "LH_H128": 158,
  "LH_H107": 159,
  "LH_H101": 160,
  "LH_H129": 161,
  "LH_H80": 162,
  "LH_H85": 163,
  "LH_H149": 164,
  "LH_H110": 165,
  "RH_H158": 166,
  "RH_H98": 167,
  "RH_H114": 168,
  "LH_H170": 169,
  "RH_H151": 170,
  "RH_H152": 171,
  "LH_H113": 172,
  "RH_H142": 173,
  "LH_H137": 174,
  "RH_H147": 175,
  "RH_H157": 176,
  "LH_H123": 177,
  "LH_H74": 178,
  "RH_H91": 179,
  "LH_H145": 180,
  "RH_H139": 181,
  "LH_H148": 182,
  "RH_H87": 183,
  "RH_H102": 184,
  "RH_H125": 185,
  "RH_H160": 186,
  "LH_H52": 187,
  "RH_H136": 188,
  "RH_H65": 189,
  "LH_H162": 190,
  "LH_H117": 191,
  "LH_H50": 192,
  "LH_H146": 193,
  "RH_H101": 194,
  "START_LH_H23": 195,
  "RH_H124": 196,
  "LH_H150": 197,
  "LH_H63": 198,
  "LH_H161": 199,
  "RH_H53": 200,
  "LH_H172": 201,
  "LH_H51": 202,
  "LH_H121": 203,
  "RH_H113": 204,
  "LH_H88": 205,
  "RH_H48": 206,
  "RH_H57": 207,
  "RH_H153": 208,
  "LH_H169": 209,
  "LH_H96": 210,
  "RH_H76": 211,
  "RH_H159": 212,
  "LH_H99": 213,
  "RH_H90": 214,
  "LH_H77": 215,
  "RH_H145": 216,
  "RH_H80": 217,
  "LH_H151": 218,
  "RH_H168": 219,
  "RH_H112": 220,
  "LH_H154": 221,
  "RH_H47": 222,
  "RH_H123": 223,
  "LH_H167": 224,
  "LH_H66": 225,
  "LH_H171": 226,
  "LH_H140": 227,
  "RH_H146": 228,
  "LH_H143": 229,
  "LH_H173": 230,
  "LH_H178": 231,
  "RH_H170": 232,
  "LH_H168": 233,
  "START_LH_H41": 234,
  "LH_H130": 235,
  "RH_H173": 236,
  "START_LH_H30": 237,
  "RH_H172": 238,
  "LH_H163": 239,
  "RH_H167": 240,
  "LH_H141": 241,
  "LH_H45": 242,
  "LH_H55": 243,
  "LH_H166": 244,
  "RH_H171": 245,
  "RH_H134": 246,
  "LH_H132": 247,
  "RH_H54": 248,
  "LH_H152": 249,
  "LH_H97": 250,
  "RH_H79": 251,
  "RH_H156": 252,
  "LH_H108": 253,
  "RH_H183": 254,
  "RH_H111": 255,
  "RH_H89": 256,
  "START_RH_H24": 257,
  "RH_H169": 258,
  "RH_H175": 259,
  "RH_H133": 260,
  "START_RH_H35": 261,
  "LH_H75": 262,
  "LH_H64": 263,
  "LH_H119": 264,
  "LH_H181": 265,
  "RH_H78": 266,
  "RH_H166": 267,
  "RH_H181": 268,
  "RH_H155": 269,
  "RH_H184": 270,
  "LH_H53": 271,
  "LH_H182": 272,
  "RH_H122": 273,
  "RH_H67": 274,
  "RH_H99": 275,
  "LH_H179": 276,
  "LH_H180": 277,
  "RH_H186": 278,
  "LH_H98": 279,
  "RH_H40": 280,
  "LH_H44": 281,
  "RH_H182": 282,
  "RH_H88": 283,
  "START_RH_H32": 284,
  "LH_H120": 285,
  "RH_H179": 286,
  "RH_H185": 287,
  "RH_H37": 288,
  "LH_H87": 289,
  "LH_H39": 290,
  "LH_H176": 291,
  "RH_H39": 292,
  "LH_H165": 293,
  "LH_H36": 294,
  "RH_H100": 295,
  "LH_H183": 296,
  "RH_H56": 297,
  "RH_H121": 298,
  "LH_H177": 299,
  "RH_H144": 300,
  "LH_H86": 301,
  "RH_H38": 302,
  "RH_H132": 303,
  "LH_H153": 304,
  "LH_H76": 305,
  "RH_H180": 306,
  "RH_H41": 307,
  "LH_H188": 308,
  "LH_H37": 309,
  "RH_H110": 310,
  "LH_H184": 311,
  "RH_H46": 312,
  "LH_H131": 313,
  "RH_H42": 314,
  "LH_H142": 315,
  "LH_H35": 316,
  "LH_H109": 317,
  "RH_H193": 318,
  "RH_H154": 319,
  "LH_H38": 320,
  "RH_H35": 321,
  "RH_H197": 322,
  "LH_H65": 323,
  "LH_H164": 324,
  "LH_H175": 325,
  "LH_H174": 326,
  "START_RH_H43": 327,
  "LH_H192": 328,
  "RH_H36": 329,
  "LH_H194": 330,
  "LH_H191": 331,
  "LH_H189": 332,
  "RH_H45": 333,
  "RH_H195": 334,
  "RH_H191": 335,
  "RH_H143": 336,
  "RH_H192": 337,
  "RH_H66": 338,
  "LH_H193": 339,
  "LH_H40": 340,
  "START_LH_H22": 341,
  "RH_H34": 342,
  "START_LH_H33": 343,
  "RH_H194": 344,
  "LH_H41": 345,
  "LH_H190": 346,
  "RH_H196": 347,
  "RH_H178": 348,
  "RH_H177": 349,
  "RH_H77": 350,
  "LH_H185": 351,
  "RH_H55": 352,
  "LH_H186": 353,
  "RH_H190": 354,
  "LH_H34": 355,
  "LH_H54": 356,
  "RH_H176": 357,
  "LH_H196": 358,
  "RH_H165": 359,
  "LH_H42": 360,
  "LH_H187": 361,
  "RH_H43": 362,
  "LH_H195": 363,
  "RH_H44": 364,
  "RH_H188": 365,
  "LH_H33": 366,
  "LH_H197": 367,
  "RH_H189": 368,
  "LH_H43": 369,
  "RH_H33": 370,
  "RH_H187": 371
}