{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<START>": 3,
  "<END>": 4,
  "<UNK>": 5,
  "START_LH_H15": 6,
  "START_RH_H17": 7,
  "START_RH_H7": 8,
  "START_LH_H2": 9,
  "START_LH_H3": 10,
  "START_RH_H6": 11,
  "START_RH_H18": 12,
  "START_LH_H14": 13,
  "START_LH_H5": 14,
  "START_LH_H4": 15,
  "START_LH_H16": 16,
  "START_LH_H13": 17,
  "LH_H37": 18,
  "RH_H39": 19,
  "RH_H38": 20,
  "START_RH_H19": 21,
  "START_RH_H5": 22,
  "LH_H49": 23,
  "RH_H49": 24,
  "START_RH_H8": 25,
  "LH_H48": 26,
  "RH_H50": 27,
  "RH_H40": 28,
  "LH_H36": 29,
  "LH_H58": 30,
  "LH_H92": 31,
  "LH_H38": 32,
  "RH_H61": 33,
  "LH_H115": 34,
  "LH_H47": 35,
  "LH_H25": 36,
  "LH_H50": 37,
  "LH_H59": 38,
  "LH_H79": 39,
  "RH_H27": 40,
  "START_RH_H16": 41,
  "LH_H70": 42,
  "LH_H81": 43,
  "RH_H28": 44,
  "RH_H93": 45,
  "RH_H72": 46,
  "RH_H71": 47,
  "RH_H104": 48,
  "LH_H83": 49,
  "LH_H135": 50,
  "RH_H51": 51,
  "RH_H73": 52,
  "LH_H69": 53,
  "LH_H82": 54,
  "RH_H85": 55,
  "RH_H59": 56,
  "RH_H60": 57,
  "LH_H126": 58,
  "RH_H70": 59,
  "RH_H118": 60,
  "RH_H82": 61,
  "RH_H96": 62,
  "RH_H116": 63,
  "RH_H37": 64,
  "RH_H127": 65,
  "LH_H26": 66,
  "RH_H52": 67,
  "LH_H104": 68,
  "RH_H29": 69,
  "RH_H74": 70,
  "LH_H68": 71,
  "RH_H83": 72,
  "LH_H101": 73,
  "LH_H71": 74,
  "LH_H39": 75,
  "LH_H46": 76,
  "RH_H107": 77,
  "RH_H48": 78,
  "RH_H62": 79,
  "RH_H63": 80,
  "LH_H124": 81,
  "RH_H81": 82,
  "RH_H149": 83,
  "RH_H115": 84,
  "LH_H93": 85,
  "RH_H106": 86,
  "RH_H138": 87,
  "LH_H60": 88,
  "LH_H80": 89,
  "RH_H159": 90,
  "RH_H105": 91,
  "LH_H113": 92,
  "RH_H95": 93,
  "RH_H41": 94,
  "LH_H72": 95,
  "LH_H114": 96,
  "LH_H27": 97,
  "LH_H61": 98,
  "LH_H157": 99,
  "RH_H103": 100,
  "LH_H90": 101,
  "RH_H114": 102,
  "RH_H84": 103,
  "LH_H94": 104,
  "LH_H148": 105,
  "RH_H53": 106,
  "LH_H103": 107,
  "LH_H35": 108,
  "RH_H126": 109,
  "RH_H137": 110,
  "RH_H80": 111,
  "LH_H105": 112,
  "RH_H128": 113,
  "LH_H136": 114,
  "RH_H47": 115,
  "RH_H140": 116,
  "RH_H150": 117,
  "RH_H148": 118,
  "RH_H94": 119,
  "LH_H89": 120,
  "RH_H97": 121,
  "LH_H112": 122,
  "RH_H161": 123,
  "LH_H91": 124,
  "LH_H67": 125,
  "RH_H86": 126,
  "LH_H137": 127,
  "LH_H125": 128,
  "RH_H139": 129,
  "LH_H106": 130,
  "RH_H75": 131,
  "LH_H116": 132,
  "LH_H159": 133,
  "LH_H51": 134,
  "RH_H92": 135,
  "LH_H134": 136,
  "RH_H129": 137,
  "RH_H117": 138,
  "LH_H102": 139,
  "LH_H127": 140,
  "LH_H146": 141,
  "RH_H109": 142,
  "RH_H119": 143,
  "RH_H87": 144,
  "LH_H57": 145,
  "LH_H111": 146,
  "LH_H144": 147,
  "RH_H136": 148,
  "LH_H110": 149,
  "LH_H95": 150,
  "LH_H132": 151,
  "LH_H24": 152,
  "LH_H45": 153,
  "RH_H164": 154,
  "RH_H64": 155,
  "LH_H40": 156,
  "RH_H125": 157,
  "RH_H36": 158,
  "LH_H28": 159,
  "LH_H100": 160,
  "RH_H131": 161,
  "LH_H147": 162,
  "RH_H174": 163,
  "LH_H128": 164,
  "LH_H145": 165,
  "RH_H142": 166,
  "START_RH_H9": 167,
  "LH_H160": 168,
  "RH_H69": 169,
  "RH_H141": 170,
  "RH_H160": 171,
  "RH_H157": 172,
  "RH_H163": 173,
  "LH_H78": 174,
  "LH_H161": 175,
  "RH_H162": 176,
  "LH_H149": 177,
  "START_RH_H4": 178,
  "RH_H153": 179,
  "LH_H66": 180,
  "LH_H166": 181,
  "LH_H73": 182,
  "LH_H158": 183,
  "RH_H26": 184,
  "RH_H108": 185,
  "LH_H121": 186,
  "LH_H84": 187,
  "LH_H117": 188,
  "LH_H138": 189,
  "LH_H155": 190,
  "LH_H99": 191,
  "RH_H98": 192,
  "RH_H146": 193,
  "RH_H120": 194,
  "RH_H42": 195,
  "LH_H123": 196,
  "LH_H156": 197,
  "LH_H122": 198,
  "LH_H34": 199,
  "RH_H151": 200,
  "RH_H172": 201,
  "RH_H30": 202,
  "RH_H130": 203,
  "LH_H56": 204,
  "LH_H154": 205,
  "LH_H88": 206,
  "LH_H85": 207,
  "RH_H158": 208,
  "RH_H91": 209,
  "LH_H143": 210,
  "RH_H152": 211,
  "LH_H139": 212,
  "RH_H76": 213,
  "RH_H113": 214,
  "LH_H77": 215,
  "LH_H133": 216,
  "RH_H147": 217,
  "RH_H102": 218,
  "LH_H150": 219,
  "LH_H170": 220,
  "LH_H172": 221,
  "RH_H135": 222,
  "START_RH_H15": 223,
  "LH_H44": 224,
  "LH_H169": 225,
  "RH_H58": 226,
  "LH_H23": 227,
  "START_RH_H20": 228,
  "RH_H156": 229,
  "LH_H165": 230,
  "RH_H169": 231,
  "RH_H181": 232,
  "RH_H124": 233,
  "LH_H62": 234,
  "RH_H79": 235,
  "LH_H107": 236,
  "RH_H25": 237,
  "RH_H183": 238,
  "LH_H140": 239,
  "LH_H168": 240,
  "RH_H112": 241,
  "RH_H170": 242,
  "LH_H162": 243,
  "RH_H90": 244,
  "RH_H134": 245,
  "RH_H168": 246,
  "LH_H178": 247,
  "RH_H167": 248,
  "LH_H33": 249,
  "RH_H145": 250,
  "LH_H55": 251,
  "RH_H175": 252,
  "RH_H123": 253,
  "LH_H171": 254,
  "RH_H186": 255,
  "LH_H177": 256,
  "LH_H14": 257,
  "LH_H173": 258,
  "RH_H171": 259,
  "LH_H74": 260,
  "RH_H54": 261,
  "LH_H118": 262,
  "LH_H29": 263,
  "LH_H96": 264,
  "RH_H17": 265,
  "RH_H65": 266,
  "LH_H151": 267,
  "RH_H173": 268,
  "RH_H101": 269,
  "RH_H43": 270,
  "LH_H16": 271,
  "RH_H16": 272,
  "LH_H129": 273,
  "LH_H15": 274,
  "RH_H68": 275,
  "LH_H167": 276,
  "RH_H182": 277,
  "LH_H179": 278,
  "RH_H31": 279,
  "RH_H180": 280,
  "RH_H18": 281,
  "RH_H184": 282,
  "LH_H52": 283,
  "LH_H63": 284,
  "LH_H181": 285,
  "RH_H57": 286,
  "LH_H183": 287,
  "RH_H111": 288,
  "RH_H15": 289,
  "LH_H182": 290,
  "LH_H176": 291,
  "LH_H163": 292,
  "LH_H119": 293,
  "LH_H180": 294,
  "RH_H35": 295,
  "RH_H32": 296,
  "LH_H41": 297,
  "RH_H46": 298,
  "RH_H197": 299,
  "LH_H86": 300,
  "RH_H195": 301,
  "LH_H130": 302,
  "LH_H17": 303,
  "LH_H22": 304,
  "RH_H179": 305,
  "RH_H100": 306,
  "RH_H56": 307,
  "LH_H53": 308,
  "LH_H30": 309,
  "RH_H190": 310,
  "LH_H152": 311,
  "RH_H144": 312,
  "LH_H13": 313,
  "LH_H187": 314,
  "RH_H19": 315,
  "RH_H133": 316,
  "LH_H188": 317,
  "LH_H75": 318,
  "RH_H89": 319,
  "RH_H155": 320,
  "RH_H166": 321,
  "RH_H185": 322,
  "RH_H193": 323,
  "LH_H192": 324,
  "RH_H191": 325,
  "LH_H97": 326,
  "RH_H122": 327,
  "LH_H184": 328,
  "RH_H178": 329,
  "LH_H141": 330,
  "LH_H191": 331,
  "LH_H12": 332,
  "RH_H67": 333,
  "RH_H20": 334,
  "LH_H18": 335,
  "LH_H108": 336,
  "LH_H189": 337,
  "RH_H24": 338,
  "RH_H177": 339,
  "RH_H14": 340,
  "LH_H194": 341,
  "RH_H154": 342,
  "RH_H78": 343,
  "LH_H64": 344,
  "LH_H190": 345,
  "RH_H110": 346,
  "LH_H185": 347,
  "RH_H196": 348,
  "LH_H131": 349,
  "LH_H193": 350,
  "LH_H174": 351,
  "LH_H164": 352,
  "RH_H21": 353,
  "LH_H109": 354,
  "RH_H143": 355,
  "RH_H194": 356,
  "LH_H153": 357,
  "LH_H142": 358,
  "RH_H192": 359,
  "RH_H66": 360,
  "LH_H42": 361,
  "RH_H55": 362,
  "LH_H76": 363,
  "RH_H88": 364,
  "LH_H196": 365,
  "LH_H19": 366,
  "LH_H175": 367,
  "RH_H77": 368,
  "RH_H189": 369,
  "RH_H132": 370,
  "RH_H121": 371,
  "RH_H34": 372,
  "RH_H99": 373,
  "RH_H45": 374,
  "RH_H13": 375,
  "LH_H120": 376,
  "LH_H65": 377,
  "LH_H98": 378,
  "LH_H195": 379,
  "LH_H87": 380,
  "LH_H11": 381,
  "RH_H165": 382,
  "LH_H54": 383,
  "RH_H187": 384,
  "LH_H186": 385,
  "RH_H176": 386,
  "RH_H188": 387,
  "RH_H44": 388,
  "LH_H197": 389,
  "LH_H31": 390,
  "RH_H33": 391,
  "LH_H20": 392,
  "LH_H43": 393,
  "RH_H12": 394,
  "LH_H21": 395,
  "LH_H32": 396
}