{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<START>": 3,
  "<END>": 4,
  "<UNK>": 5,
  "START_RH_H39": 6,
  "START_LH_H37": 7,
  "START_RH_H38": 8,
  "START_LH_H38": 9,
  "START_RH_H28": 10,
  "START_LH_H39": 11,
  "START_LH_H25": 12,
  "START_LH_H27": 13,
  "START_RH_H40": 14,
  "START_LH_H36": 15,
  "START_LH_H26": 16,
  "START_RH_H27": 17,
  "START_LH_H28": 18,
  "START_RH_H29": 19,
  "RH_H62": 20,
  "RH_H60": 21,
  "RH_H72": 22,
  "LH_H71": 23,
  "LH_H60": 24,
  "LH_H70": 25,
  "RH_H73": 26,
  "LH_H59": 27,
  "RH_H61": 28,
  "RH_H71": 29,
  "START_RH_H41": 30,
  "LH_H49": 31,
  "START_RH_H26": 32,
  "LH_H148": 33,
  "LH_H147": 34,
  "RH_H93": 35,
  "LH_H93": 36,
  "RH_H95": 37,
  "LH_H91": 38,
  "LH_H72": 39,
  "LH_H58": 40,
  "LH_H48": 41,
  "RH_H126": 42,
  "LH_H69": 43,
  "LH_H83": 44,
  "LH_H136": 45,
  "LH_H68": 46,
  "LH_H61": 47,
  "RH_H149": 48,
  "RH_H50": 49,
  "RH_H160": 50,
  "RH_H63": 51,
  "LH_H92": 52,
  "RH_H104": 53,
  "RH_H74": 54,
  "RH_H84": 55,
  "LH_H102": 56,
  "LH_H81": 57,
  "RH_H82": 58,
  "RH_H94": 59,
  "RH_H116": 60,
  "RH_H138": 61,
  "LH_H116": 62,
  "RH_H83": 63,
  "LH_H82": 64,
  "RH_H103": 65,
  "RH_H107": 66,
  "RH_H115": 67,
  "LH_H103": 68,
  "RH_H127": 69,
  "RH_H59": 70,
  "LH_H159": 71,
  "RH_H150": 72,
  "LH_H104": 73,
  "LH_H114": 74,
  "RH_H114": 75,
  "LH_H123": 76,
  "START_RH_H30": 77,
  "RH_H51": 78,
  "RH_H147": 79,
  "LH_H126": 80,
  "LH_H125": 81,
  "LH_H124": 82,
  "RH_H128": 83,
  "LH_H113": 84,
  "RH_H105": 85,
  "LH_H149": 86,
  "LH_H79": 87,
  "LH_H90": 88,
  "LH_H62": 89,
  "RH_H92": 90,
  "LH_H115": 91,
  "RH_H136": 92,
  "RH_H151": 93,
  "LH_H127": 94,
  "RH_H85": 95,
  "RH_H96": 96,
  "RH_H70": 97,
  "LH_H112": 98,
  "LH_H101": 99,
  "LH_H135": 100,
  "RH_H117": 101,
  "LH_H134": 102,
  "START_RH_H37": 103,
  "LH_H146": 104,
  "LH_H57": 105,
  "RH_H125": 106,
  "RH_H158": 107,
  "LH_H94": 108,
  "RH_H109": 109,
  "RH_H64": 110,
  "LH_H137": 111,
  "LH_H160": 112,
  "LH_H73": 113,
  "RH_H139": 114,
  "RH_H129": 115,
  "LH_H105": 116,
  "LH_H138": 117,
  "RH_H106": 118,
  "LH_H84": 119,
  "RH_H118": 120,
  "LH_H157": 121,
  "RH_H148": 122,
  "RH_H98": 123,
  "RH_H97": 124,
  "RH_H140": 125,
  "RH_H137": 126,
  "LH_H80": 127,
  "RH_H81": 128,
  "LH_H47": 129,
  "LH_H145": 130,
  "LH_H50": 131,
  "LH_H95": 132,
  "LH_H158": 133,
  "LH_H156": 134,
  "LH_H100": 135,
  "LH_H139": 136,
  "RH_H49": 137,
  "RH_H86": 138,
  "RH_H131": 139,
  "LH_H128": 140,
  "RH_H119": 141,
  "RH_H161": 142,
  "LH_H168": 143,
  "LH_H133": 144,
  "LH_H169": 145,
  "RH_H76": 146,
  "RH_H146": 147,
  "RH_H172": 148,
  "LH_H170": 149,
  "RH_H108": 150,
  "RH_H159": 151,
  "RH_H75": 152,
  "LH_H106": 153,
  "RH_H130": 154,
  "RH_H87": 155,
  "RH_H124": 156,
  "LH_H171": 157,
  "LH_H46": 158,
  "LH_H117": 159,
  "LH_H122": 160,
  "RH_H171": 161,
  "RH_H52": 162,
  "RH_H170": 163,
  "RH_H182": 164,
  "RH_H135": 165,
  "RH_H120": 166,
  "LH_H67": 167,
  "RH_H142": 168,
  "RH_H162": 169,
  "RH_H91": 170,
  "RH_H169": 171,
  "RH_H113": 172,
  "RH_H53": 173,
  "LH_H89": 174,
  "RH_H181": 175,
  "LH_H150": 176,
  "RH_H152": 177,
  "LH_H161": 178,
  "RH_H80": 179,
  "LH_H129": 180,
  "RH_H157": 181,
  "LH_H111": 182,
  "LH_H121": 183,
  "LH_H143": 184,
  "LH_H56": 185,
  "LH_H144": 186,
  "RH_H65": 187,
  "RH_H153": 188,
  "RH_H69": 189,
  "LH_H132": 190,
  "LH_H181": 191,
  "LH_H51": 192,
  "RH_H141": 193,
  "LH_H99": 194,
  "RH_H102": 195,
  "RH_H48": 196,
  "LH_H88": 197,
  "LH_H77": 198,
  "RH_H183": 199,
  "LH_H182": 200,
  "LH_H107": 201,
  "LH_H178": 202,
  "RH_H112": 203,
  "LH_H180": 204,
  "RH_H145": 205,
  "LH_H172": 206,
  "RH_H168": 207,
  "LH_H78": 208,
  "LH_H37": 209,
  "LH_H96": 210,
  "LH_H110": 211,
  "LH_H151": 212,
  "LH_H74": 213,
  "RH_H180": 214,
  "LH_H118": 215,
  "RH_H58": 216,
  "RH_H173": 217,
  "RH_H134": 218,
  "LH_H63": 219,
  "RH_H39": 220,
  "LH_H140": 221,
  "LH_H155": 222,
  "RH_H38": 223,
  "LH_H36": 224,
  "RH_H40": 225,
  "RH_H101": 226,
  "RH_H123": 227,
  "LH_H167": 228,
  "RH_H163": 229,
  "LH_H85": 230,
  "RH_H54": 231,
  "LH_H55": 232,
  "LH_H66": 233,
  "LH_H38": 234,
  "RH_H184": 235,
  "LH_H130": 236,
  "RH_H156": 237,
  "LH_H179": 238,
  "RH_H164": 239,
  "LH_H183": 240,
  "RH_H79": 241,
  "LH_H154": 242,
  "LH_H97": 243,
  "RH_H90": 244,
  "LH_H166": 245,
  "LH_H173": 246,
  "LH_H192": 247,
  "RH_H179": 248,
  "LH_H119": 249,
  "RH_H68": 250,
  "RH_H193": 251,
  "RH_H57": 252,
  "RH_H167": 253,
  "LH_H108": 254,
  "RH_H185": 255,
  "RH_H191": 256,
  "LH_H193": 257,
  "LH_H75": 258,
  "RH_H122": 259,
  "RH_H144": 260,
  "LH_H165": 261,
  "RH_H195": 262,
  "RH_H89": 263,
  "RH_H174": 264,
  "RH_H47": 265,
  "LH_H45": 266,
  "LH_H177": 267,
  "RH_H194": 268,
  "LH_H190": 269,
  "RH_H41": 270,
  "LH_H86": 271,
  "LH_H40": 272,
  "LH_H39": 273,
  "RH_H42": 274,
  "RH_H178": 275,
  "RH_H192": 276,
  "LH_H162": 277,
  "LH_H189": 278,
  "RH_H100": 279,
  "RH_H175": 280,
  "LH_H152": 281,
  "LH_H184": 282,
  "LH_H52": 283,
  "LH_H191": 284,
  "RH_H133": 285,
  "RH_H155": 286,
  "RH_H78": 287,
  "LH_H34": 288,
  "LH_H141": 289,
  "LH_H35": 290,
  "RH_H189": 291,
  "RH_H111": 292,
  "RH_H186": 293,
  "LH_H176": 294,
  "LH_H44": 295,
  "LH_H194": 296,
  "LH_H195": 297,
  "LH_H120": 298,
  "RH_H46": 299,
  "RH_H37": 300,
  "LH_H163": 301,
  "LH_H64": 302,
  "RH_H67": 303,
  "RH_H190": 304,
  "LH_H109": 305,
  "LH_H41": 306,
  "LH_H98": 307,
  "RH_H43": 308,
  "LH_H188": 309,
  "RH_H166": 310,
  "RH_H35": 311,
  "RH_H36": 312,
  "LH_H174": 313,
  "LH_H53": 314,
  "LH_H153": 315,
  "LH_H164": 316,
  "LH_H33": 317,
  "RH_H177": 318,
  "RH_H197": 319,
  "RH_H56": 320,
  "LH_H185": 321,
  "LH_H87": 322,
  "LH_H187": 323,
  "RH_H196": 324,
  "LH_H142": 325,
  "RH_H143": 326,
  "LH_H186": 327,
  "RH_H188": 328,
  "LH_H131": 329,
  "LH_H196": 330,
  "LH_H76": 331,
  "RH_H187": 332,
  "RH_H154": 333,
  "LH_H175": 334,
  "RH_H176": 335,
  "LH_H42": 336,
  "LH_H65": 337,
  "RH_H165": 338,
  "RH_H110": 339,
  "RH_H45": 340,
  "RH_H121": 341,
  "LH_H197": 342
}