{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3,
  "<G0>": 4,
  "<G1>": 5,
  "<G2>": 6,
  "<G3>": 7,
  "<G4>": 8,
  "<G5>": 9,
  "<G6>": 10,
  "<G7>": 11,
  "<G8>": 12,
  "<G9>": 13,
  "<G10>": 14,
  "<G11>": 15,
  "<G12>": 16,
  "<G13>": 17,
  "<G14>": 18,
  "<G15>": 19,
  "<G16>": 20,
  "<G17>": 21,
  "<G18>": 22,
  "<G19>": 23,
  "<G20>": 24,
  "START_H0": 25,
  "START_H1": 26,
  "START_H2": 27,
  "START_H3": 28,
  "START_H4": 29,
  "START_H5": 30,
  "START_H6": 31,
  "START_H7": 32,
  "START_H8": 33,
  "START_H9": 34,
  "START_H10": 35,
  "START_H11": 36,
  "START_H12": 37,
  "START_H13": 38,
  "START_H14": 39,
  "START_H15": 40,
  "START_H16": 41,
  "START_H17": 42,
  "START_H18": 43,
  "START_H19": 44,
  "START_H20": 45,
  "START_H21": 46,
  "START_H22": 47,
  "START_H23": 48,
  "START_H24": 49,
  "START_H25": 50,
  "START_H26": 51,
  "START_H27": 52,
  "START_H28": 53,
  "START_H29": 54,
  "START_H30": 55,
  "START_H31": 56,
  "START_H32": 57,
  "START_H33": 58,
  "START_H34": 59,
  "START_H35": 60,
  "START_H36": 61,
  "START_H37": 62,
  "START_H38": 63,
  "START_H39": 64,
  "START_H40": 65,
  "START_H41": 66,
  "START_H42": 67,
  "START_H43": 68,
  "START_H44": 69,
  "START_H45": 70,
  "START_H46": 71,
  "START_H47": 72,
  "START_H48": 73,
  "START_H49": 74,
  "START_H50": 75,
  "START_H51": 76,
  "START_H52": 77,
  "START_H53": 78,
  "START_H54": 79,
  "START_H55": 80,
  "START_H56": 81,
  "START_H57": 82,
  "START_H58": 83,
  "START_H59": 84,
  "START_H60": 85,
  "START_H61": 86,
  "START_H62": 87,
  "START_H63": 88,
  "START_H64": 89,
  "START_H65": 90,
  "START_H66": 91,
  "START_H67": 92,
  "START_H68": 93,
  "START_H69": 94,
  "START_H70": 95,
  "START_H71": 96,
  "START_H72": 97,
  "START_H73": 98,
  "START_H74": 99,
  "START_H75": 100,
  "START_H76": 101,
  "START_H77": 102,
  "START_H78": 103,
  "START_H79": 104,
  "START_H80": 105,
  "START_H81": 106,
  "START_H82": 107,
  "START_H83": 108,
  "START_H84": 109,
  "START_H85": 110,
  "START_H86": 111,
  "START_H87": 112,
  "START_H88": 113,
  "START_H89": 114,
  "START_H90": 115,
  "START_H91": 116,
  "START_H92": 117,
  "START_H93": 118,
  "START_H94": 119,
  "START_H95": 120,
  "START_H96": 121,
  "START_H97": 122,
  "START_H98": 123,
  "START_H99": 124,
  "START_H100": 125,
  "START_H101": 126,
  "START_H102": 127,
  "START_H103": 128,
  "START_H104": 129,
  "START_H105": 130,
  "START_H106": 131,
  "START_H107": 132,
  "START_H108": 133,
  "START_H109": 134,
  "START_H110": 135,
  "START_H111": 136,
  "START_H112": 137,
  "START_H113": 138,
  "START_H114": 139,
  "START_H115": 140,
  "START_H116": 141,
  "START_H117": 142,
  "START_H118": 143,
  "START_H119": 144,
  "START_H120": 145,
  "START_H121": 146,
  "START_H122": 147,
  "START_H123": 148,
  "START_H124": 149,
  "START_H125": 150,
  "START_H126": 151,
  "START_H127": 152,
  "START_H128": 153,
  "START_H129": 154,
  "START_H130": 155,
  "START_H131": 156,
  "START_H132": 157,
  "START_H133": 158,
  "START_H134": 159,
  "START_H135": 160,
  "START_H136": 161,
  "START_H137": 162,
  "START_H138": 163,
  "START_H139": 164,
  "START_H140": 165,
  "START_H141": 166,
  "START_H142": 167,
  "START_H143": 168,
  "START_H144": 169,
  "START_H145": 170,
  "START_H146": 171,
  "START_H147": 172,
  "START_H148": 173,
  "START_H149": 174,
  "START_H150": 175,
  "START_H151": 176,
  "START_H152": 177,
  "START_H153": 178,
  "START_H154": 179,
  "START_H155": 180,
  "START_H156": 181,
  "START_H157": 182,
  "START_H158": 183,
  "START_H159": 184,
  "START_H160": 185,
  "START_H161": 186,
  "START_H162": 187,
  "START_H163": 188,
  "START_H164": 189,
  "START_H165": 190,
  "START_H166": 191,
  "START_H167": 192,
  "START_H168": 193,
  "START_H169": 194,
  "START_H170": 195,
  "START_H171": 196,
  "START_H172": 197,
  "START_H173": 198,
  "START_H174": 199,
  "START_H175": 200,
  "START_H176": 201,
  "START_H177": 202,
  "START_H178": 203,
  "START_H179": 204,
  "START_H180": 205,
  "START_H181": 206,
  "START_H182": 207,
  "START_H183": 208,
  "START_H184": 209,
  "START_H185": 210,
  "START_H186": 211,
  "START_H187": 212,
  "START_H188": 213,
  "START_H189": 214,
  "START_H190": 215,
  "START_H191": 216,
  "START_H192": 217,
  "START_H193": 218,
  "START_H194": 219,
  "START_H195": 220,
  "START_H196": 221,
  "START_H197": 222,
  "MOVE_R-18_C-11": 223,
  "MOVE_R-18_C-10": 224,
  "MOVE_R-18_C-9": 225,
  "MOVE_R-18_C-8": 226,
  "MOVE_R-18_C-7": 227,
  "MOVE_R-18_C-6": 228,
  "MOVE_R-18_C-5": 229,
  "MOVE_R-18_C-4": 230,
  "MOVE_R-18_C-3": 231,
  "MOVE_R-18_C-2": 232,
  "MOVE_R-18_C-1": 233,
  "MOVE_R-18_C+0": 234,
  "MOVE_R-18_C+1": 235,
  "MOVE_R-18_C+2": 236,
  "MOVE_R-18_C+3": 237,
  "MOVE_R-18_C+4": 238,
  "MOVE_R-18_C+5": 239,
  "MOVE_R-18_C+6": 240,
  "MOVE_R-18_C+7": 241,
  "MOVE_R-18_C+8": 242,
  "MOVE_R-18_C+9": 243,
  "MOVE_R-18_C+10": 244,
  "MOVE_R-18_C+11": 245,
  "MOVE_R-17_C-11": 246,
  "MOVE_R-17_C-10": 247,
  "MOVE_R-17_C-9": 248,
  "MOVE_R-17_C-8": 249,
  "MOVE_R-17_C-7": 250,
  "MOVE_R-17_C-6": 251,
  "MOVE_R-17_C-5": 252,
  "MOVE_R-17_C-4": 253,
  "MOVE_R-17_C-3": 254,
  "MOVE_R-17_C-2": 255,
  "MOVE_R-17_C-1": 256,
  "MOVE_R-17_C+0": 257,
  "MOVE_R-17_C+1": 258,
  "MOVE_R-17_C+2": 259,
  "MOVE_R-17_C+3": 260,
  "MOVE_R-17_C+4": 261,
  "MOVE_R-17_C+5": 262,
  "MOVE_R-17_C+6": 263,
  "MOVE_R-17_C+7": 264,
  "MOVE_R-17_C+8": 265,
  "MOVE_R-17_C+9": 266,
  "MOVE_R-17_C+10": 267,
  "MOVE_R-17_C+11": 268,
  "MOVE_R-16_C-11": 269,
  "MOVE_R-16_C-10": 270,
  "MOVE_R-16_C-9": 271,
  "MOVE_R-16_C-8": 272,
  "MOVE_R-16_C-7": 273,
  "MOVE_R-16_C-6": 274,
  "MOVE_R-16_C-5": 275,
  "MOVE_R-16_C-4": 276,
  "MOVE_R-16_C-3": 277,
  "MOVE_R-16_C-2": 278,
  "MOVE_R-16_C-1": 279,
  "MOVE_R-16_C+0": 280,
  "MOVE_R-16_C+1": 281,
  "MOVE_R-16_C+2": 282,
  "MOVE_R-16_C+3": 283,
  "MOVE_R-16_C+4": 284,
  "MOVE_R-16_C+5": 285,
  "MOVE_R-16_C+6": 286,
  "MOVE_R-16_C+7": 287,
  "MOVE_R-16_C+8": 288,
  "MOVE_R-16_C+9": 289,
  "MOVE_R-16_C+10": 290,
  "MOVE_R-16_C+11": 291,
  "MOVE_R-15_C-11": 292,
  "MOVE_R-15_C-10": 293,
  "MOVE_R-15_C-9": 294,
  "MOVE_R-15_C-8": 295,
  "MOVE_R-15_C-7": 296,
  "MOVE_R-15_C-6": 297,
  "MOVE_R-15_C-5": 298,
  "MOVE_R-15_C-4": 299,
  "MOVE_R-15_C-3": 300,
  "MOVE_R-15_C-2": 301,
  "MOVE_R-15_C-1": 302,
  "MOVE_R-15_C+0": 303,
  "MOVE_R-15_C+1": 304,
  "MOVE_R-15_C+2": 305,
  "MOVE_R-15_C+3": 306,
  "MOVE_R-15_C+4": 307,
  "MOVE_R-15_C+5": 308,
  "MOVE_R-15_C+6": 309,
  "MOVE_R-15_C+7": 310,
  "MOVE_R-15_C+8": 311,
  "MOVE_R-15_C+9": 312,
  "MOVE_R-15_C+10": 313,
  "MOVE_R-15_C+11": 314,
  "MOVE_R-14_C-11": 315,
  "MOVE_R-14_C-10": 316,
  "MOVE_R-14_C-9": 317,
  "MOVE_R-14_C-8": 318,
  "MOVE_R-14_C-7": 319,
  "MOVE_R-14_C-6": 320,
  "MOVE_R-14_C-5": 321,
  "MOVE_R-14_C-4": 322,
  "MOVE_R-14_C-3": 323,
  "MOVE_R-14_C-2": 324,
  "MOVE_R-14_C-1": 325,
  "MOVE_R-14_C+0": 326,
  "MOVE_R-14_C+1": 327,
  "MOVE_R-14_C+2": 328,
  "MOVE_R-14_C+3": 329,
  "MOVE_R-14_C+4": 330,
  "MOVE_R-14_C+5": 331,
  "MOVE_R-14_C+6": 332,
  "MOVE_R-14_C+7": 333,
  "MOVE_R-14_C+8": 334,
  "MOVE_R-14_C+9": 335,
  "MOVE_R-14_C+10": 336,
  "MOVE_R-14_C+11": 337,
  "MOVE_R-13_C-11": 338,
  "MOVE_R-13_C-10": 339,
  "MOVE_R-13_C-9": 340,
  "MOVE_R-13_C-8": 341,
  "MOVE_R-13_C-7": 342,
  "MOVE_R-13_C-6": 343,
  "MOVE_R-13_C-5": 344,
  "MOVE_R-13_C-4": 345,
  "MOVE_R-13_C-3": 346,
  "MOVE_R-13_C-2": 347,
  "MOVE_R-13_C-1": 348,
  "MOVE_R-13_C+0": 349,
  "MOVE_R-13_C+1": 350,
  "MOVE_R-13_C+2": 351,
  "MOVE_R-13_C+3": 352,
  "MOVE_R-13_C+4": 353,
  "MOVE_R-13_C+5": 354,
  "MOVE_R-13_C+6": 355,
  "MOVE_R-13_C+7": 356,
  "MOVE_R-13_C+8": 357,
  "MOVE_R-13_C+9": 358,
  "MOVE_R-13_C+10": 359,
  "MOVE_R-13_C+11": 360,
  "MOVE_R-12_C-11": 361,
  "MOVE_R-12_C-10": 362,
  "MOVE_R-12_C-9": 363,
  "MOVE_R-12_C-8": 364,
  "MOVE_R-12_C-7": 365,
  "MOVE_R-12_C-6": 366,
  "MOVE_R-12_C-5": 367,
  "MOVE_R-12_C-4": 368,
  "MOVE_R-12_C-3": 369,
  "MOVE_R-12_C-2": 370,
  "MOVE_R-12_C-1": 371,
  "MOVE_R-12_C+0": 372,
  "MOVE_R-12_C+1": 373,
  "MOVE_R-12_C+2": 374,
  "MOVE_R-12_C+3": 375,
  "MOVE_R-12_C+4": 376,
  "MOVE_R-12_C+5": 377,
  "MOVE_R-12_C+6": 378,
  "MOVE_R-12_C+7": 379,
  "MOVE_R-12_C+8": 380,
  "MOVE_R-12_C+9": 381,
  "MOVE_R-12_C+10": 382,
  "MOVE_R-12_C+11": 383,
  "MOVE_R-11_C-11": 384,
  "MOVE_R-11_C-10": 385,
  "MOVE_R-11_C-9": 386,
  "MOVE_R-11_C-8": 387,
  "MOVE_R-11_C-7": 388,
  "MOVE_R-11_C-6": 389,
  "MOVE_R-11_C-5": 390,
  "MOVE_R-11_C-4": 391,
  "MOVE_R-11_C-3": 392,
  "MOVE_R-11_C-2": 393,
  "MOVE_R-11_C-1": 394,
  "MOVE_R-11_C+0": 395,
  "MOVE_R-11_C+1": 396,
  "MOVE_R-11_C+2": 397,
  "MOVE_R-11_C+3": 398,
  "MOVE_R-11_C+4": 399,
  "MOVE_R-11_C+5": 400,
  "MOVE_R-11_C+6": 401,
  "MOVE_R-11_C+7": 402,
  "MOVE_R-11_C+8": 403,
  "MOVE_R-11_C+9": 404,
  "MOVE_R-11_C+10": 405,
  "MOVE_R-11_C+11": 406,
  "MOVE_R-10_C-11": 407,
  "MOVE_R-10_C-10": 408,
  "MOVE_R-10_C-9": 409,
  "MOVE_R-10_C-8": 410,
  "MOVE_R-10_C-7": 411,
  "MOVE_R-10_C-6": 412,
  "MOVE_R-10_C-5": 413,
  "MOVE_R-10_C-4": 414,
  "MOVE_R-10_C-3": 415,
  "MOVE_R-10_C-2": 416,
  "MOVE_R-10_C-1": 417,
  "MOVE_R-10_C+0": 418,
  "MOVE_R-10_C+1": 419,
  "MOVE_R-10_C+2": 420,
  "MOVE_R-10_C+3": 421,
  "MOVE_R-10_C+4": 422,
  "MOVE_R-10_C+5": 423,
  "MOVE_R-10_C+6": 424,
  "MOVE_R-10_C+7": 425,
  "MOVE_R-10_C+8": 426,
  "MOVE_R-10_C+9": 427,
  "MOVE_R-10_C+10": 428,
  "MOVE_R-10_C+11": 429,
  "MOVE_R-9_C-11": 430,
  "MOVE_R-9_C-10": 431,
  "MOVE_R-9_C-9": 432,
  "MOVE_R-9_C-8": 433,
  "MOVE_R-9_C-7": 434,
  "MOVE_R-9_C-6": 435,
  "MOVE_R-9_C-5": 436,
  "MOVE_R-9_C-4": 437,
  "MOVE_R-9_C-3": 438,
  "MOVE_R-9_C-2": 439,
  "MOVE_R-9_C-1": 440,
  "MOVE_R-9_C+0": 441,
  "MOVE_R-9_C+1": 442,
  "MOVE_R-9_C+2": 443,
  "MOVE_R-9_C+3": 444,
  "MOVE_R-9_C+4": 445,
  "MOVE_R-9_C+5": 446,
  "MOVE_R-9_C+6": 447,
  "MOVE_R-9_C+7": 448,
  "MOVE_R-9_C+8": 449,
  "MOVE_R-9_C+9": 450,
  "MOVE_R-9_C+10": 451,
  "MOVE_R-9_C+11": 452,
  "MOVE_R-8_C-11": 453,
  "MOVE_R-8_C-10": 454,
  "MOVE_R-8_C-9": 455,
  "MOVE_R-8_C-8": 456,
  "MOVE_R-8_C-7": 457,
  "MOVE_R-8_C-6": 458,
  "MOVE_R-8_C-5": 459,
  "MOVE_R-8_C-4": 460,
  "MOVE_R-8_C-3": 461,
  "MOVE_R-8_C-2": 462,
  "MOVE_R-8_C-1": 463,
  "MOVE_R-8_C+0": 464,
  "MOVE_R-8_C+1": 465,
  "MOVE_R-8_C+2": 466,
  "MOVE_R-8_C+3": 467,
  "MOVE_R-8_C+4": 468,
  "MOVE_R-8_C+5": 469,
  "MOVE_R-8_C+6": 470,
  "MOVE_R-8_C+7": 471,
  "MOVE_R-8_C+8": 472,
  "MOVE_R-8_C+9": 473,
  "MOVE_R-8_C+10": 474,
  "MOVE_R-8_C+11": 475,
  "MOVE_R-7_C-11": 476,
  "MOVE_R-7_C-10": 477,
  "MOVE_R-7_C-9": 478,
  "MOVE_R-7_C-8": 479,
  "MOVE_R-7_C-7": 480,
  "MOVE_R-7_C-6": 481,
  "MOVE_R-7_C-5": 482,
  "MOVE_R-7_C-4": 483,
  "MOVE_R-7_C-3": 484,
  "MOVE_R-7_C-2": 485,
  "MOVE_R-7_C-1": 486,
  "MOVE_R-7_C+0": 487,
  "MOVE_R-7_C+1": 488,
  "MOVE_R-7_C+2": 489,
  "MOVE_R-7_C+3": 490,
  "MOVE_R-7_C+4": 491,
  "MOVE_R-7_C+5": 492,
  "MOVE_R-7_C+6": 493,
  "MOVE_R-7_C+7": 494,
  "MOVE_R-7_C+8": 495,
  "MOVE_R-7_C+9": 496,
  "MOVE_R-7_C+10": 497,
  "MOVE_R-7_C+11": 498,
  "MOVE_R-6_C-11": 499,
  "MOVE_R-6_C-10": 500,
  "MOVE_R-6_C-9": 501,
  "MOVE_R-6_C-8": 502,
  "MOVE_R-6_C-7": 503,
  "MOVE_R-6_C-6": 504,
  "MOVE_R-6_C-5": 505,
  "MOVE_R-6_C-4": 506,
  "MOVE_R-6_C-3": 507,
  "MOVE_R-6_C-2": 508,
  "MOVE_R-6_C-1": 509,
  "MOVE_R-6_C+0": 510,
  "MOVE_R-6_C+1": 511,
  "MOVE_R-6_C+2": 512,
  "MOVE_R-6_C+3": 513,
  "MOVE_R-6_C+4": 514,
  "MOVE_R-6_C+5": 515,
  "MOVE_R-6_C+6": 516,
  "MOVE_R-6_C+7": 517,
  "MOVE_R-6_C+8": 518,
  "MOVE_R-6_C+9": 519,
  "MOVE_R-6_C+10": 520,
  "MOVE_R-6_C+11": 521,
  "MOVE_R-5_C-11": 522,
  "MOVE_R-5_C-10": 523,
  "MOVE_R-5_C-9": 524,
  "MOVE_R-5_C-8": 525,
  "MOVE_R-5_C-7": 526,
  "MOVE_R-5_C-6": 527,
  "MOVE_R-5_C-5": 528,
  "MOVE_R-5_C-4": 529,
  "MOVE_R-5_C-3": 530,
  "MOVE_R-5_C-2": 531,
  "MOVE_R-5_C-1": 532,
  "MOVE_R-5_C+0": 533,
  "MOVE_R-5_C+1": 534,
  "MOVE_R-5_C+2": 535,
  "MOVE_R-5_C+3": 536,
  "MOVE_R-5_C+4": 537,
  "MOVE_R-5_C+5": 538,
  "MOVE_R-5_C+6": 539,
  "MOVE_R-5_C+7": 540,
  "MOVE_R-5_C+8": 541,
  "MOVE_R-5_C+9": 542,
  "MOVE_R-5_C+10": 543,
  "MOVE_R-5_C+11": 544,
  "MOVE_R-4_C-11": 545,
  "MOVE_R-4_C-10": 546,
  "MOVE_R-4_C-9": 547,
  "MOVE_R-4_C-8": 548,
  "MOVE_R-4_C-7": 549,
  "MOVE_R-4_C-6": 550,
  "MOVE_R-4_C-5": 551,
  "MOVE_R-4_C-4": 552,
  "MOVE_R-4_C-3": 553,
  "MOVE_R-4_C-2": 554,
  "MOVE_R-4_C-1": 555,
  "MOVE_R-4_C+0": 556,
  "MOVE_R-4_C+1": 557,
  "MOVE_R-4_C+2": 558,
  "MOVE_R-4_C+3": 559,
  "MOVE_R-4_C+4": 560,
  "MOVE_R-4_C+5": 561,
  "MOVE_R-4_C+6": 562,
  "MOVE_R-4_C+7": 563,
  "MOVE_R-4_C+8": 564,
  "MOVE_R-4_C+9": 565,
  "MOVE_R-4_C+10": 566,
  "MOVE_R-4_C+11": 567,
  "MOVE_R-3_C-11": 568,
  "MOVE_R-3_C-10": 569,
  "MOVE_R-3_C-9": 570,
  "MOVE_R-3_C-8": 571,
  "MOVE_R-3_C-7": 572,
  "MOVE_R-3_C-6": 573,
  "MOVE_R-3_C-5": 574,
  "MOVE_R-3_C-4": 575,
  "MOVE_R-3_C-3": 576,
  "MOVE_R-3_C-2": 577,
  "MOVE_R-3_C-1": 578,
  "MOVE_R-3_C+0": 579,
  "MOVE_R-3_C+1": 580,
  "MOVE_R-3_C+2": 581,
  "MOVE_R-3_C+3": 582,
  "MOVE_R-3_C+4": 583,
  "MOVE_R-3_C+5": 584,
  "MOVE_R-3_C+6": 585,
  "MOVE_R-3_C+7": 586,
  "MOVE_R-3_C+8": 587,
  "MOVE_R-3_C+9": 588,
  "MOVE_R-3_C+10": 589,
  "MOVE_R-3_C+11": 590,
  "MOVE_R-2_C-11": 591,
  "MOVE_R-2_C-10": 592,
  "MOVE_R-2_C-9": 593,
  "MOVE_R-2_C-8": 594,
  "MOVE_R-2_C-7": 595,
  "MOVE_R-2_C-6": 596,
  "MOVE_R-2_C-5": 597,
  "MOVE_R-2_C-4": 598,
  "MOVE_R-2_C-3": 599,
  "MOVE_R-2_C-2": 600,
  "MOVE_R-2_C-1": 601,
  "MOVE_R-2_C+0": 602,
  "MOVE_R-2_C+1": 603,
  "MOVE_R-2_C+2": 604,
  "MOVE_R-2_C+3": 605,
  "MOVE_R-2_C+4": 606,
  "MOVE_R-2_C+5": 607,
  "MOVE_R-2_C+6": 608,
  "MOVE_R-2_C+7": 609,
  "MOVE_R-2_C+8": 610,
  "MOVE_R-2_C+9": 611,
  "MOVE_R-2_C+10": 612,
  "MOVE_R-2_C+11": 613,
  "MOVE_R-1_C-11": 614,
  "MOVE_R-1_C-10": 615,
  "MOVE_R-1_C-9": 616,
  "MOVE_R-1_C-8": 617,
  "MOVE_R-1_C-7": 618,
  "MOVE_R-1_C-6": 619,
  "MOVE_R-1_C-5": 620,
  "MOVE_R-1_C-4": 621,
  "MOVE_R-1_C-3": 622,
  "MOVE_R-1_C-2": 623,
  "MOVE_R-1_C-1": 624,
  "MOVE_R-1_C+0": 625,
  "MOVE_R-1_C+1": 626,
  "MOVE_R-1_C+2": 627,
  "MOVE_R-1_C+3": 628,
  "MOVE_R-1_C+4": 629,
  "MOVE_R-1_C+5": 630,
  "MOVE_R-1_C+6": 631,
  "MOVE_R-1_C+7": 632,
  "MOVE_R-1_C+8": 633,
  "MOVE_R-1_C+9": 634,
  "MOVE_R-1_C+10": 635,
  "MOVE_R-1_C+11": 636,
  "MOVE_R+0_C-11": 637,
  "MOVE_R+0_C-10": 638,
  "MOVE_R+0_C-9": 639,
  "MOVE_R+0_C-8": 640,
  "MOVE_R+0_C-7": 641,
  "MOVE_R+0_C-6": 642,
  "MOVE_R+0_C-5": 643,
  "MOVE_R+0_C-4": 644,
  "MOVE_R+0_C-3": 645,
  "MOVE_R+0_C-2": 646,
  "MOVE_R+0_C-1": 647,
  "MOVE_R+0_C+0": 648,
  "MOVE_R+0_C+1": 649,
  "MOVE_R+0_C+2": 650,
  "MOVE_R+0_C+3": 651,
  "MOVE_R+0_C+4": 652,
  "MOVE_R+0_C+5": 653,
  "MOVE_R+0_C+6": 654,
  "MOVE_R+0_C+7": 655,
  "MOVE_R+0_C+8": 656,
  "MOVE_R+0_C+9": 657,
  "MOVE_R+0_C+10": 658,
  "MOVE_R+0_C+11": 659,
  "MOVE_R+1_C-11": 660,
  "MOVE_R+1_C-10": 661,
  "MOVE_R+1_C-9": 662,
  "MOVE_R+1_C-8": 663,
  "MOVE_R+1_C-7": 664,
  "MOVE_R+1_C-6": 665,
  "MOVE_R+1_C-5": 666,
  "MOVE_R+1_C-4": 667,
  "MOVE_R+1_C-3": 668,
  "MOVE_R+1_C-2": 669,
  "MOVE_R+1_C-1": 670,
  "MOVE_R+1_C+0": 671,
  "MOVE_R+1_C+1": 672,
  "MOVE_R+1_C+2": 673,
  "MOVE_R+1_C+3": 674,
  "MOVE_R+1_C+4": 675,
  "MOVE_R+1_C+5": 676,
  "MOVE_R+1_C+6": 677,
  "MOVE_R+1_C+7": 678,
  "MOVE_R+1_C+8": 679,
  "MOVE_R+1_C+9": 680,
  "MOVE_R+1_C+10": 681,
  "MOVE_R+1_C+11": 682,
  "MOVE_R+2_C-11": 683,
  "MOVE_R+2_C-10": 684,
  "MOVE_R+2_C-9": 685,
  "MOVE_R+2_C-8": 686,
  "MOVE_R+2_C-7": 687,
  "MOVE_R+2_C-6": 688,
  "MOVE_R+2_C-5": 689,
  "MOVE_R+2_C-4": 690,
  "MOVE_R+2_C-3": 691,
  "MOVE_R+2_C-2": 692,
  "MOVE_R+2_C-1": 693,
  "MOVE_R+2_C+0": 694,
  "MOVE_R+2_C+1": 695,
  "MOVE_R+2_C+2": 696,
  "MOVE_R+2_C+3": 697,
  "MOVE_R+2_C+4": 698,
  "MOVE_R+2_C+5": 699,
  "MOVE_R+2_C+6": 700,
  "MOVE_R+2_C+7": 701,
  "MOVE_R+2_C+8": 702,
  "MOVE_R+2_C+9": 703,
  "MOVE_R+2_C+10": 704,
  "MOVE_R+2_C+11": 705,
  "MOVE_R+3_C-11": 706,
  "MOVE_R+3_C-10": 707,
  "MOVE_R+3_C-9": 708,
  "MOVE_R+3_C-8": 709,
  "MOVE_R+3_C-7": 710,
  "MOVE_R+3_C-6": 711,
  "MOVE_R+3_C-5": 712,
  "MOVE_R+3_C-4": 713,
  "MOVE_R+3_C-3": 714,
  "MOVE_R+3_C-2": 715,
  "MOVE_R+3_C-1": 716,
  "MOVE_R+3_C+0": 717,
  "MOVE_R+3_C+1": 718,
  "MOVE_R+3_C+2": 719,
  "MOVE_R+3_C+3": 720,
  "MOVE_R+3_C+4": 721,
  "MOVE_R+3_C+5": 722,
  "MOVE_R+3_C+6": 723,
  "MOVE_R+3_C+7": 724,
  "MOVE_R+3_C+8": 725,
  "MOVE_R+3_C+9": 726,
  "MOVE_R+3_C+10": 727,
  "MOVE_R+3_C+11": 728,
  "MOVE_R+4_C-11": 729,
  "MOVE_R+4_C-10": 730,
  "MOVE_R+4_C-9": 731,
  "MOVE_R+4_C-8": 732,
  "MOVE_R+4_C-7": 733,
  "MOVE_R+4_C-6": 734,
  "MOVE_R+4_C-5": 735,
  "MOVE_R+4_C-4": 736,
  "MOVE_R+4_C-3": 737,
  "MOVE_R+4_C-2": 738,
  "MOVE_R+4_C-1": 739,
  "MOVE_R+4_C+0": 740,
  "MOVE_R+4_C+1": 741,
  "MOVE_R+4_C+2": 742,
  "MOVE_R+4_C+3": 743,
  "MOVE_R+4_C+4": 744,
  "MOVE_R+4_C+5": 745,
  "MOVE_R+4_C+6": 746,
  "MOVE_R+4_C+7": 747,
  "MOVE_R+4_C+8": 748,
  "MOVE_R+4_C+9": 749,
  "MOVE_R+4_C+10": 750,
  "MOVE_R+4_C+11": 751,
  "MOVE_R+5_C-11": 752,
  "MOVE_R+5_C-10": 753,
  "MOVE_R+5_C-9": 754,
  "MOVE_R+5_C-8": 755,
  "MOVE_R+5_C-7": 756,
  "MOVE_R+5_C-6": 757,
  "MOVE_R+5_C-5": 758,
  "MOVE_R+5_C-4": 759,
  "MOVE_R+5_C-3": 760,
  "MOVE_R+5_C-2": 761,
  "MOVE_R+5_C-1": 762,
  "MOVE_R+5_C+0": 763,
  "MOVE_R+5_C+1": 764,
  "MOVE_R+5_C+2": 765,
  "MOVE_R+5_C+3": 766,
  "MOVE_R+5_C+4": 767,
  "MOVE_R+5_C+5": 768,
  "MOVE_R+5_C+6": 769,
  "MOVE_R+5_C+7": 770,
  "MOVE_R+5_C+8": 771,
  "MOVE_R+5_C+9": 772,
  "MOVE_R+5_C+10": 773,
  "MOVE_R+5_C+11": 774,
  "MOVE_R+6_C-11": 775,
  "MOVE_R+6_C-10": 776,
  "MOVE_R+6_C-9": 777,
  "MOVE_R+6_C-8": 778,
  "MOVE_R+6_C-7": 779,
  "MOVE_R+6_C-6": 780,
  "MOVE_R+6_C-5": 781,
  "MOVE_R+6_C-4": 782,
  "MOVE_R+6_C-3": 783,
  "MOVE_R+6_C-2": 784,
  "MOVE_R+6_C-1": 785,
  "MOVE_R+6_C+0": 786,
  "MOVE_R+6_C+1": 787,
  "MOVE_R+6_C+2": 788,
  "MOVE_R+6_C+3": 789,
  "MOVE_R+6_C+4": 790,
  "MOVE_R+6_C+5": 791,
  "MOVE_R+6_C+6": 792,
  "MOVE_R+6_C+7": 793,
  "MOVE_R+6_C+8": 794,
  "MOVE_R+6_C+9": 795,
  "MOVE_R+6_C+10": 796,
  "MOVE_R+6_C+11": 797,
  "MOVE_R+7_C-11": 798,
  "MOVE_R+7_C-10": 799,
  "MOVE_R+7_C-9": 800,
  "MOVE_R+7_C-8": 801,
  "MOVE_R+7_C-7": 802,
  "MOVE_R+7_C-6": 803,
  "MOVE_R+7_C-5": 804,
  "MOVE_R+7_C-4": 805,
  "MOVE_R+7_C-3": 806,
  "MOVE_R+7_C-2": 807,
  "MOVE_R+7_C-1": 808,
  "MOVE_R+7_C+0": 809,
  "MOVE_R+7_C+1": 810,
  "MOVE_R+7_C+2": 811,
  "MOVE_R+7_C+3": 812,
  "MOVE_R+7_C+4": 813,
  "MOVE_R+7_C+5": 814,
  "MOVE_R+7_C+6": 815,
  "MOVE_R+7_C+7": 816,
  "MOVE_R+7_C+8": 817,
  "MOVE_R+7_C+9": 818,
  "MOVE_R+7_C+10": 819,
  "MOVE_R+7_C+11": 820,
  "MOVE_R+8_C-11": 821,
  "MOVE_R+8_C-10": 822,
  "MOVE_R+8_C-9": 823,
  "MOVE_R+8_C-8": 824,
  "MOVE_R+8_C-7": 825,
  "MOVE_R+8_C-6": 826,
  "MOVE_R+8_C-5": 827,
  "MOVE_R+8_C-4": 828,
  "MOVE_R+8_C-3": 829,
  "MOVE_R+8_C-2": 830,
  "MOVE_R+8_C-1": 831,
  "MOVE_R+8_C+0": 832,
  "MOVE_R+8_C+1": 833,
  "MOVE_R+8_C+2": 834,
  "MOVE_R+8_C+3": 835,
  "MOVE_R+8_C+4": 836,
  "MOVE_R+8_C+5": 837,
  "MOVE_R+8_C+6": 838,
  "MOVE_R+8_C+7": 839,
  "MOVE_R+8_C+8": 840,
  "MOVE_R+8_C+9": 841,
  "MOVE_R+8_C+10": 842,
  "MOVE_R+8_C+11": 843,
  "MOVE_R+9_C-11": 844,
  "MOVE_R+9_C-10": 845,
  "MOVE_R+9_C-9": 846,
  "MOVE_R+9_C-8": 847,
  "MOVE_R+9_C-7": 848,
  "MOVE_R+9_C-6": 849,
  "MOVE_R+9_C-5": 850,
  "MOVE_R+9_C-4": 851,
  "MOVE_R+9_C-3": 852,
  "MOVE_R+9_C-2": 853,
  "MOVE_R+9_C-1": 854,
  "MOVE_R+9_C+0": 855,
  "MOVE_R+9_C+1": 856,
  "MOVE_R+9_C+2": 857,
  "MOVE_R+9_C+3": 858,
  "MOVE_R+9_C+4": 859,
  "MOVE_R+9_C+5": 860,
  "MOVE_R+9_C+6": 861,
  "MOVE_R+9_C+7": 862,
  "MOVE_R+9_C+8": 863,
  "MOVE_R+9_C+9": 864,
  "MOVE_R+9_C+10": 865,
  "MOVE_R+9_C+11": 866,
  "MOVE_R+10_C-11": 867,
  "MOVE_R+10_C-10": 868,
  "MOVE_R+10_C-9": 869,
  "MOVE_R+10_C-8": 870,
  "MOVE_R+10_C-7": 871,
  "MOVE_R+10_C-6": 872,
  "MOVE_R+10_C-5": 873,
  "MOVE_R+10_C-4": 874,
  "MOVE_R+10_C-3": 875,
  "MOVE_R+10_C-2": 876,
  "MOVE_R+10_C-1": 877,
  "MOVE_R+10_C+0": 878,
  "MOVE_R+10_C+1": 879,
  "MOVE_R+10_C+2": 880,
  "MOVE_R+10_C+3": 881,
  "MOVE_R+10_C+4": 882,
  "MOVE_R+10_C+5": 883,
  "MOVE_R+10_C+6": 884,
  "MOVE_R+10_C+7": 885,
  "MOVE_R+10_C+8": 886,
  "MOVE_R+10_C+9": 887,
  "MOVE_R+10_C+10": 888,
  "MOVE_R+10_C+11": 889,
  "MOVE_R+11_C-11": 890,
  "MOVE_R+11_C-10": 891,
  "MOVE_R+11_C-9": 892,
  "MOVE_R+11_C-8": 893,
  "MOVE_R+11_C-7": 894,
  "MOVE_R+11_C-6": 895,
  "MOVE_R+11_C-5": 896,
  "MOVE_R+11_C-4": 897,
  "MOVE_R+11_C-3": 898,
  "MOVE_R+11_C-2": 899,
  "MOVE_R+11_C-1": 900,
  "MOVE_R+11_C+0": 901,
  "MOVE_R+11_C+1": 902,
  "MOVE_R+11_C+2": 903,
  "MOVE_R+11_C+3": 904,
  "MOVE_R+11_C+4": 905,
  "MOVE_R+11_C+5": 906,
  "MOVE_R+11_C+6": 907,
  "MOVE_R+11_C+7": 908,
  "MOVE_R+11_C+8": 909,
  "MOVE_R+11_C+9": 910,
  "MOVE_R+11_C+10": 911,
  "MOVE_R+11_C+11": 912,
  "MOVE_R+12_C-11": 913,
  "MOVE_R+12_C-10": 914,
  "MOVE_R+12_C-9": 915,
  "MOVE_R+12_C-8": 916,
  "MOVE_R+12_C-7": 917,
  "MOVE_R+12_C-6": 918,
  "MOVE_R+12_C-5": 919,
  "MOVE_R+12_C-4": 920,
  "MOVE_R+12_C-3": 921,
  "MOVE_R+12_C-2": 922,
  "MOVE_R+12_C-1": 923,
  "MOVE_R+12_C+0": 924,
  "MOVE_R+12_C+1": 925,
  "MOVE_R+12_C+2": 926,
  "MOVE_R+12_C+3": 927,
  "MOVE_R+12_C+4": 928,
  "MOVE_R+12_C+5": 929,
  "MOVE_R+12_C+6": 930,
  "MOVE_R+12_C+7": 931,
  "MOVE_R+12_C+8": 932,
  "MOVE_R+12_C+9": 933,
  "MOVE_R+12_C+10": 934,
  "MOVE_R+12_C+11": 935,
  "MOVE_R+13_C-11": 936,
  "MOVE_R+13_C-10": 937,
  "MOVE_R+13_C-9": 938,
  "MOVE_R+13_C-8": 939,
  "MOVE_R+13_C-7": 940,
  "MOVE_R+13_C-6": 941,
  "MOVE_R+13_C-5": 942,
  "MOVE_R+13_C-4": 943,
  "MOVE_R+13_C-3": 944,
  "MOVE_R+13_C-2": 945,
  "MOVE_R+13_C-1": 946,
  "MOVE_R+13_C+0": 947,
  "MOVE_R+13_C+1": 948,
  "MOVE_R+13_C+2": 949,
  "MOVE_R+13_C+3": 950,
  "MOVE_R+13_C+4": 951,
  "MOVE_R+13_C+5": 952,
  "MOVE_R+13_C+6": 953,
  "MOVE_R+13_C+7": 954,
  "MOVE_R+13_C+8": 955,
  "MOVE_R+13_C+9": 956,
  "MOVE_R+13_C+10": 957,
  "MOVE_R+13_C+11": 958,
  "MOVE_R+14_C-11": 959,
  "MOVE_R+14_C-10": 960,
  "MOVE_R+14_C-9": 961,
  "MOVE_R+14_C-8": 962,
  "MOVE_R+14_C-7": 963,
  "MOVE_R+14_C-6": 964,
  "MOVE_R+14_C-5": 965,
  "MOVE_R+14_C-4": 966,
  "MOVE_R+14_C-3": 967,
  "MOVE_R+14_C-2": 968,
  "MOVE_R+14_C-1": 969,
  "MOVE_R+14_C+0": 970,
  "MOVE_R+14_C+1": 971,
  "MOVE_R+14_C+2": 972,
  "MOVE_R+14_C+3": 973,
  "MOVE_R+14_C+4": 974,
  "MOVE_R+14_C+5": 975,
  "MOVE_R+14_C+6": 976,
  "MOVE_R+14_C+7": 977,
  "MOVE_R+14_C+8": 978,
  "MOVE_R+14_C+9": 979,
  "MOVE_R+14_C+10": 980,
  "MOVE_R+14_C+11": 981,
  "MOVE_R+15_C-11": 982,
  "MOVE_R+15_C-10": 983,
  "MOVE_R+15_C-9": 984,
  "MOVE_R+15_C-8": 985,
  "MOVE_R+15_C-7": 986,
  "MOVE_R+15_C-6": 987,
  "MOVE_R+15_C-5": 988,
  "MOVE_R+15_C-4": 989,
  "MOVE_R+15_C-3": 990,
  "MOVE_R+15_C-2": 991,
  "MOVE_R+15_C-1": 992,
  "MOVE_R+15_C+0": 993,
  "MOVE_R+15_C+1": 994,
  "MOVE_R+15_C+2": 995,
  "MOVE_R+15_C+3": 996,
  "MOVE_R+15_C+4": 997,
  "MOVE_R+15_C+5": 998,
  "MOVE_R+15_C+6": 999,
  "MOVE_R+15_C+7": 1000,
  "MOVE_R+15_C+8": 1001,
  "MOVE_R+15_C+9": 1002,
  "MOVE_R+15_C+10": 1003,
  "MOVE_R+15_C+11": 1004,
  "MOVE_R+16_C-11": 1005,
  "MOVE_R+16_C-10": 1006,
  "MOVE_R+16_C-9": 1007,
  "MOVE_R+16_C-8": 1008,
  "MOVE_R+16_C-7": 1009,
  "MOVE_R+16_C-6": 1010,
  "MOVE_R+16_C-5": 1011,
  "MOVE_R+16_C-4": 1012,
  "MOVE_R+16_C-3": 1013,
  "MOVE_R+16_C-2": 1014,
  "MOVE_R+16_C-1": 1015,
  "MOVE_R+16_C+0": 1016,
  "MOVE_R+16_C+1": 1017,
  "MOVE_R+16_C+2": 1018,
  "MOVE_R+16_C+3": 1019,
  "MOVE_R+16_C+4": 1020,
  "MOVE_R+16_C+5": 1021,
  "MOVE_R+16_C+6": 1022,
  "MOVE_R+16_C+7": 1023,
  "MOVE_R+16_C+8": 1024,
  "MOVE_R+16_C+9": 1025,
  "MOVE_R+16_C+10": 1026,
  "MOVE_R+16_C+11": 1027,
  "MOVE_R+17_C-11": 1028,
  "MOVE_R+17_C-10": 1029,
  "MOVE_R+17_C-9": 1030,
  "MOVE_R+17_C-8": 1031,
  "MOVE_R+17_C-7": 1032,
  "MOVE_R+17_C-6": 1033,
  "MOVE_R+17_C-5": 1034,
  "MOVE_R+17_C-4": 1035,
  "MOVE_R+17_C-3": 1036,
  "MOVE_R+17_C-2": 1037,
  "MOVE_R+17_C-1": 1038,
  "MOVE_R+17_C+0": 1039,
  "MOVE_R+17_C+1": 1040,
  "MOVE_R+17_C+2": 1041,
  "MOVE_R+17_C+3": 1042,
  "MOVE_R+17_C+4": 1043,
  "MOVE_R+17_C+5": 1044,
  "MOVE_R+17_C+6": 1045,
  "MOVE_R+17_C+7": 1046,
  "MOVE_R+17_C+8": 1047,
  "MOVE_R+17_C+9": 1048,
  "MOVE_R+17_C+10": 1049,
  "MOVE_R+17_C+11": 1050,
  "MOVE_R+18_C-11": 1051,
  "MOVE_R+18_C-10": 1052,
  "MOVE_R+18_C-9": 1053,
  "MOVE_R+18_C-8": 1054,
  "MOVE_R+18_C-7": 1055,
  "MOVE_R+18_C-6": 1056,
  "MOVE_R+18_C-5": 1057,
  "MOVE_R+18_C-4": 1058,
  "MOVE_R+18_C-3": 1059,
  "MOVE_R+18_C-2": 1060,
  "MOVE_R+18_C-1": 1061,
  "MOVE_R+18_C+0": 1062,
  "MOVE_R+18_C+1": 1063,
  "MOVE_R+18_C+2": 1064,
  "MOVE_R+18_C+3": 1065,
  "MOVE_R+18_C+4": 1066,
  "MOVE_R+18_C+5": 1067,
  "MOVE_R+18_C+6": 1068,
  "MOVE_R+18_C+7": 1069,
  "MOVE_R+18_C+8": 1070,
  "MOVE_R+18_C+9": 1071,
  "MOVE_R+18_C+10": 1072,
  "MOVE_R+18_C+11": 1073,
  "DYNO_R-18_C-11": 1074,
  "DYNO_R-18_C-10": 1075,
  "DYNO_R-18_C-9": 1076,
  "DYNO_R-18_C-8": 1077,
  "DYNO_R-18_C-7": 1078,
  "DYNO_R-18_C-6": 1079,
  "DYNO_R-18_C-5": 1080,
  "DYNO_R-18_C-4": 1081,
  "DYNO_R-18_C-3": 1082,
  "DYNO_R-18_C-2": 1083,
  "DYNO_R-18_C-1": 1084,
  "DYNO_R-18_C+0": 1085,
  "DYNO_R-18_C+1": 1086,
  "DYNO_R-18_C+2": 1087,
  "DYNO_R-18_C+3": 1088,
  "DYNO_R-18_C+4": 1089,
  "DYNO_R-18_C+5": 1090,
  "DYNO_R-18_C+6": 1091,
  "DYNO_R-18_C+7": 1092,
  "DYNO_R-18_C+8": 1093,
  "DYNO_R-18_C+9": 1094,
  "DYNO_R-18_C+10": 1095,
  "DYNO_R-18_C+11": 1096,
  "DYNO_R-17_C-11": 1097,
  "DYNO_R-17_C-10": 1098,
  "DYNO_R-17_C-9": 1099,
  "DYNO_R-17_C-8": 1100,
  "DYNO_R-17_C-7": 1101,
  "DYNO_R-17_C-6": 1102,
  "DYNO_R-17_C-5": 1103,
  "DYNO_R-17_C-4": 1104,
  "DYNO_R-17_C-3": 1105,
  "DYNO_R-17_C-2": 1106,
  "DYNO_R-17_C-1": 1107,
  "DYNO_R-17_C+0": 1108,
  "DYNO_R-17_C+1": 1109,
  "DYNO_R-17_C+2": 1110,
  "DYNO_R-17_C+3": 1111,
  "DYNO_R-17_C+4": 1112,
  "DYNO_R-17_C+5": 1113,
  "DYNO_R-17_C+6": 1114,
  "DYNO_R-17_C+7": 1115,
  "DYNO_R-17_C+8": 1116,
  "DYNO_R-17_C+9": 1117,
  "DYNO_R-17_C+10": 1118,
  "DYNO_R-17_C+11": 1119,
  "DYNO_R-16_C-11": 1120,
  "DYNO_R-16_C-10": 1121,
  "DYNO_R-16_C-9": 1122,
  "DYNO_R-16_C-8": 1123,
  "DYNO_R-16_C-7": 1124,
  "DYNO_R-16_C-6": 1125,
  "DYNO_R-16_C-5": 1126,
  "DYNO_R-16_C-4": 1127,
  "DYNO_R-16_C-3": 1128,
  "DYNO_R-16_C-2": 1129,
  "DYNO_R-16_C-1": 1130,
  "DYNO_R-16_C+0": 1131,
  "DYNO_R-16_C+1": 1132,
  "DYNO_R-16_C+2": 1133,
  "DYNO_R-16_C+3": 1134,
  "DYNO_R-16_C+4": 1135,
  "DYNO_R-16_C+5": 1136,
  "DYNO_R-16_C+6": 1137,
  "DYNO_R-16_C+7": 1138,
  "DYNO_R-16_C+8": 1139,
  "DYNO_R-16_C+9": 1140,
  "DYNO_R-16_C+10": 1141,
  "DYNO_R-16_C+11": 1142,
  "DYNO_R-15_C-11": 1143,
  "DYNO_R-15_C-10": 1144,
  "DYNO_R-15_C-9": 1145,
  "DYNO_R-15_C-8": 1146,
  "DYNO_R-15_C-7": 1147,
  "DYNO_R-15_C-6": 1148,
  "DYNO_R-15_C-5": 1149,
  "DYNO_R-15_C-4": 1150,
  "DYNO_R-15_C-3": 1151,
  "DYNO_R-15_C-2": 1152,
  "DYNO_R-15_C-1": 1153,
  "DYNO_R-15_C+0": 1154,
  "DYNO_R-15_C+1": 1155,
  "DYNO_R-15_C+2": 1156,
  "DYNO_R-15_C+3": 1157,
  "DYNO_R-15_C+4": 1158,
  "DYNO_R-15_C+5": 1159,
  "DYNO_R-15_C+6": 1160,
  "DYNO_R-15_C+7": 1161,
  "DYNO_R-15_C+8": 1162,
  "DYNO_R-15_C+9": 1163,
  "DYNO_R-15_C+10": 1164,
  "DYNO_R-15_C+11": 1165,
  "DYNO_R-14_C-11": 1166,
  "DYNO_R-14_C-10": 1167,
  "DYNO_R-14_C-9": 1168,
  "DYNO_R-14_C-8": 1169,
  "DYNO_R-14_C-7": 1170,
  "DYNO_R-14_C-6": 1171,
  "DYNO_R-14_C-5": 1172,
  "DYNO_R-14_C-4": 1173,
  "DYNO_R-14_C-3": 1174,
  "DYNO_R-14_C-2": 1175,
  "DYNO_R-14_C-1": 1176,
  "DYNO_R-14_C+0": 1177,
  "DYNO_R-14_C+1": 1178,
  "DYNO_R-14_C+2": 1179,
  "DYNO_R-14_C+3": 1180,
  "DYNO_R-14_C+4": 1181,
  "DYNO_R-14_C+5": 1182,
  "DYNO_R-14_C+6": 1183,
  "DYNO_R-14_C+7": 1184,
  "DYNO_R-14_C+8": 1185,
  "DYNO_R-14_C+9": 1186,
  "DYNO_R-14_C+10": 1187,
  "DYNO_R-14_C+11": 1188,
  "DYNO_R-13_C-11": 1189,
  "DYNO_R-13_C-10": 1190,
  "DYNO_R-13_C-9": 1191,
  "DYNO_R-13_C-8": 1192,
  "DYNO_R-13_C-7": 1193,
  "DYNO_R-13_C-6": 1194,
  "DYNO_R-13_C-5": 1195,
  "DYNO_R-13_C-4": 1196,
  "DYNO_R-13_C-3": 1197,
  "DYNO_R-13_C-2": 1198,
  "DYNO_R-13_C-1": 1199,
  "DYNO_R-13_C+0": 1200,
  "DYNO_R-13_C+1": 1201,
  "DYNO_R-13_C+2": 1202,
  "DYNO_R-13_C+3": 1203,
  "DYNO_R-13_C+4": 1204,
  "DYNO_R-13_C+5": 1205,
  "DYNO_R-13_C+6": 1206,
  "DYNO_R-13_C+7": 1207,
  "DYNO_R-13_C+8": 1208,
  "DYNO_R-13_C+9": 1209,
  "DYNO_R-13_C+10": 1210,
  "DYNO_R-13_C+11": 1211,
  "DYNO_R-12_C-11": 1212,
  "DYNO_R-12_C-10": 1213,
  "DYNO_R-12_C-9": 1214,
  "DYNO_R-12_C-8": 1215,
  "DYNO_R-12_C-7": 1216,
  "DYNO_R-12_C-6": 1217,
  "DYNO_R-12_C-5": 1218,
  "DYNO_R-12_C-4": 1219,
  "DYNO_R-12_C-3": 1220,
  "DYNO_R-12_C-2": 1221,
  "DYNO_R-12_C-1": 1222,
  "DYNO_R-12_C+0": 1223,
  "DYNO_R-12_C+1": 1224,
  "DYNO_R-12_C+2": 1225,
  "DYNO_R-12_C+3": 1226,
  "DYNO_R-12_C+4": 1227,
  "DYNO_R-12_C+5": 1228,
  "DYNO_R-12_C+6": 1229,
  "DYNO_R-12_C+7": 1230,
  "DYNO_R-12_C+8": 1231,
  "DYNO_R-12_C+9": 1232,
  "DYNO_R-12_C+10": 1233,
  "DYNO_R-12_C+11": 1234,
  "DYNO_R-11_C-11": 1235,
  "DYNO_R-11_C-10": 1236,
  "DYNO_R-11_C-9": 1237,
  "DYNO_R-11_C-8": 1238,
  "DYNO_R-11_C-7": 1239,
  "DYNO_R-11_C-6": 1240,
  "DYNO_R-11_C-5": 1241,
  "DYNO_R-11_C-4": 1242,
  "DYNO_R-11_C-3": 1243,
  "DYNO_R-11_C-2": 1244,
  "DYNO_R-11_C-1": 1245,
  "DYNO_R-11_C+0": 1246,
  "DYNO_R-11_C+1": 1247,
  "DYNO_R-11_C+2": 1248,
  "DYNO_R-11_C+3": 1249,
  "DYNO_R-11_C+4": 1250,
  "DYNO_R-11_C+5": 1251,
  "DYNO_R-11_C+6": 1252,
  "DYNO_R-11_C+7": 1253,
  "DYNO_R-11_C+8": 1254,
  "DYNO_R-11_C+9": 1255,
  "DYNO_R-11_C+10": 1256,
  "DYNO_R-11_C+11": 1257,
  "DYNO_R-10_C-11": 1258,
  "DYNO_R-10_C-10": 1259,
  "DYNO_R-10_C-9": 1260,
  "DYNO_R-10_C-8": 1261,
  "DYNO_R-10_C-7": 1262,
  "DYNO_R-10_C-6": 1263,
  "DYNO_R-10_C-5": 1264,
  "DYNO_R-10_C-4": 1265,
  "DYNO_R-10_C-3": 1266,
  "DYNO_R-10_C-2": 1267,
  "DYNO_R-10_C-1": 1268,
  "DYNO_R-10_C+0": 1269,
  "DYNO_R-10_C+1": 1270,
  "DYNO_R-10_C+2": 1271,
  "DYNO_R-10_C+3": 1272,
  "DYNO_R-10_C+4": 1273,
  "DYNO_R-10_C+5": 1274,
  "DYNO_R-10_C+6": 1275,
  "DYNO_R-10_C+7": 1276,
  "DYNO_R-10_C+8": 1277,
  "DYNO_R-10_C+9": 1278,
  "DYNO_R-10_C+10": 1279,
  "DYNO_R-10_C+11": 1280,
  "DYNO_R-9_C-11": 1281,
  "DYNO_R-9_C-10": 1282,
  "DYNO_R-9_C-9": 1283,
  "DYNO_R-9_C-8": 1284,
  "DYNO_R-9_C-7": 1285,
  "DYNO_R-9_C-6": 1286,
  "DYNO_R-9_C-5": 1287,
  "DYNO_R-9_C-4": 1288,
  "DYNO_R-9_C-3": 1289,
  "DYNO_R-9_C-2": 1290,
  "DYNO_R-9_C-1": 1291,
  "DYNO_R-9_C+0": 1292,
  "DYNO_R-9_C+1": 1293,
  "DYNO_R-9_C+2": 1294,
  "DYNO_R-9_C+3": 1295,
  "DYNO_R-9_C+4": 1296,
  "DYNO_R-9_C+5": 1297,
  "DYNO_R-9_C+6": 1298,
  "DYNO_R-9_C+7": 1299,
  "DYNO_R-9_C+8": 1300,
  "DYNO_R-9_C+9": 1301,
  "DYNO_R-9_C+10": 1302,
  "DYNO_R-9_C+11": 1303,
  "DYNO_R-8_C-11": 1304,
  "DYNO_R-8_C-10": 1305,
  "DYNO_R-8_C-9": 1306,
  "DYNO_R-8_C-8": 1307,
  "DYNO_R-8_C-7": 1308,
  "DYNO_R-8_C-6": 1309,
  "DYNO_R-8_C-5": 1310,
  "DYNO_R-8_C-4": 1311,
  "DYNO_R-8_C-3": 1312,
  "DYNO_R-8_C-2": 1313,
  "DYNO_R-8_C-1": 1314,
  "DYNO_R-8_C+0": 1315,
  "DYNO_R-8_C+1": 1316,
  "DYNO_R-8_C+2": 1317,
  "DYNO_R-8_C+3": 1318,
  "DYNO_R-8_C+4": 1319,
  "DYNO_R-8_C+5": 1320,
  "DYNO_R-8_C+6": 1321,
  "DYNO_R-8_C+7": 1322,
  "DYNO_R-8_C+8": 1323,
  "DYNO_R-8_C+9": 1324,
  "DYNO_R-8_C+10": 1325,
  "DYNO_R-8_C+11": 1326,
  "DYNO_R-7_C-11": 1327,
  "DYNO_R-7_C-10": 1328,
  "DYNO_R-7_C-9": 1329,
  "DYNO_R-7_C-8": 1330,
  "DYNO_R-7_C-7": 1331,
  "DYNO_R-7_C-6": 1332,
  "DYNO_R-7_C-5": 1333,
  "DYNO_R-7_C-4": 1334,
  "DYNO_R-7_C-3": 1335,
  "DYNO_R-7_C-2": 1336,
  "DYNO_R-7_C-1": 1337,
  "DYNO_R-7_C+0": 1338,
  "DYNO_R-7_C+1": 1339,
  "DYNO_R-7_C+2": 1340,
  "DYNO_R-7_C+3": 1341,
  "DYNO_R-7_C+4": 1342,
  "DYNO_R-7_C+5": 1343,
  "DYNO_R-7_C+6": 1344,
  "DYNO_R-7_C+7": 1345,
  "DYNO_R-7_C+8": 1346,
  "DYNO_R-7_C+9": 1347,
  "DYNO_R-7_C+10": 1348,
  "DYNO_R-7_C+11": 1349,
  "DYNO_R-6_C-11": 1350,
  "DYNO_R-6_C-10": 1351,
  "DYNO_R-6_C-9": 1352,
  "DYNO_R-6_C-8": 1353,
  "DYNO_R-6_C-7": 1354,
  "DYNO_R-6_C-6": 1355,
  "DYNO_R-6_C-5": 1356,
  "DYNO_R-6_C-4": 1357,
  "DYNO_R-6_C-3": 1358,
  "DYNO_R-6_C-2": 1359,
  "DYNO_R-6_C-1": 1360,
  "DYNO_R-6_C+0": 1361,
  "DYNO_R-6_C+1": 1362,
  "DYNO_R-6_C+2": 1363,
  "DYNO_R-6_C+3": 1364,
  "DYNO_R-6_C+4": 1365,
  "DYNO_R-6_C+5": 1366,
  "DYNO_R-6_C+6": 1367,
  "DYNO_R-6_C+7": 1368,
  "DYNO_R-6_C+8": 1369,
  "DYNO_R-6_C+9": 1370,
  "DYNO_R-6_C+10": 1371,
  "DYNO_R-6_C+11": 1372,
  "DYNO_R-5_C-11": 1373,
  "DYNO_R-5_C-10": 1374,
  "DYNO_R-5_C-9": 1375,
  "DYNO_R-5_C-8": 1376,
  "DYNO_R-5_C-7": 1377,
  "DYNO_R-5_C-6": 1378,
  "DYNO_R-5_C-5": 1379,
  "DYNO_R-5_C-4": 1380,
  "DYNO_R-5_C-3": 1381,
  "DYNO_R-5_C-2": 1382,
  "DYNO_R-5_C-1": 1383,
  "DYNO_R-5_C+0": 1384,
  "DYNO_R-5_C+1": 1385,
  "DYNO_R-5_C+2": 1386,
  "DYNO_R-5_C+3": 1387,
  "DYNO_R-5_C+4": 1388,
  "DYNO_R-5_C+5": 1389,
  "DYNO_R-5_C+6": 1390,
  "DYNO_R-5_C+7": 1391,
  "DYNO_R-5_C+8": 1392,
  "DYNO_R-5_C+9": 1393,
  "DYNO_R-5_C+10": 1394,
  "DYNO_R-5_C+11": 1395,
  "DYNO_R-4_C-11": 1396,
  "DYNO_R-4_C-10": 1397,
  "DYNO_R-4_C-9": 1398,
  "DYNO_R-4_C-8": 1399,
  "DYNO_R-4_C-7": 1400,
  "DYNO_R-4_C-6": 1401,
  "DYNO_R-4_C-5": 1402,
  "DYNO_R-4_C-4": 1403,
  "DYNO_R-4_C-3": 1404,
  "DYNO_R-4_C-2": 1405,
  "DYNO_R-4_C-1": 1406,
  "DYNO_R-4_C+0": 1407,
  "DYNO_R-4_C+1": 1408,
  "DYNO_R-4_C+2": 1409,
  "DYNO_R-4_C+3": 1410,
  "DYNO_R-4_C+4": 1411,
  "DYNO_R-4_C+5": 1412,
  "DYNO_R-4_C+6": 1413,
  "DYNO_R-4_C+7": 1414,
  "DYNO_R-4_C+8": 1415,
  "DYNO_R-4_C+9": 1416,
  "DYNO_R-4_C+10": 1417,
  "DYNO_R-4_C+11": 1418,
  "DYNO_R-3_C-11": 1419,
  "DYNO_R-3_C-10": 1420,
  "DYNO_R-3_C-9": 1421,
  "DYNO_R-3_C-8": 1422,
  "DYNO_R-3_C-7": 1423,
  "DYNO_R-3_C-6": 1424,
  "DYNO_R-3_C-5": 1425,
  "DYNO_R-3_C-4": 1426,
  "DYNO_R-3_C-3": 1427,
  "DYNO_R-3_C-2": 1428,
  "DYNO_R-3_C-1": 1429,
  "DYNO_R-3_C+0": 1430,
  "DYNO_R-3_C+1": 1431,
  "DYNO_R-3_C+2": 1432,
  "DYNO_R-3_C+3": 1433,
  "DYNO_R-3_C+4": 1434,
  "DYNO_R-3_C+5": 1435,
  "DYNO_R-3_C+6": 1436,
  "DYNO_R-3_C+7": 1437,
  "DYNO_R-3_C+8": 1438,
  "DYNO_R-3_C+9": 1439,
  "DYNO_R-3_C+10": 1440,
  "DYNO_R-3_C+11": 1441,
  "DYNO_R-2_C-11": 1442,
  "DYNO_R-2_C-10": 1443,
  "DYNO_R-2_C-9": 1444,
  "DYNO_R-2_C-8": 1445,
  "DYNO_R-2_C-7": 1446,
  "DYNO_R-2_C-6": 1447,
  "DYNO_R-2_C-5": 1448,
  "DYNO_R-2_C-4": 1449,
  "DYNO_R-2_C-3": 1450,
  "DYNO_R-2_C-2": 1451,
  "DYNO_R-2_C-1": 1452,
  "DYNO_R-2_C+0": 1453,
  "DYNO_R-2_C+1": 1454,
  "DYNO_R-2_C+2": 1455,
  "DYNO_R-2_C+3": 1456,
  "DYNO_R-2_C+4": 1457,
  "DYNO_R-2_C+5": 1458,
  "DYNO_R-2_C+6": 1459,
  "DYNO_R-2_C+7": 1460,
  "DYNO_R-2_C+8": 1461,
  "DYNO_R-2_C+9": 1462,
  "DYNO_R-2_C+10": 1463,
  "DYNO_R-2_C+11": 1464,
  "DYNO_R-1_C-11": 1465,
  "DYNO_R-1_C-10": 1466,
  "DYNO_R-1_C-9": 1467,
  "DYNO_R-1_C-8": 1468,
  "DYNO_R-1_C-7": 1469,
  "DYNO_R-1_C-6": 1470,
  "DYNO_R-1_C-5": 1471,
  "DYNO_R-1_C-4": 1472,
  "DYNO_R-1_C-3": 1473,
  "DYNO_R-1_C-2": 1474,
  "DYNO_R-1_C-1": 1475,
  "DYNO_R-1_C+0": 1476,
  "DYNO_R-1_C+1": 1477,
  "DYNO_R-1_C+2": 1478,
  "DYNO_R-1_C+3": 1479,
  "DYNO_R-1_C+4": 1480,
  "DYNO_R-1_C+5": 1481,
  "DYNO_R-1_C+6": 1482,
  "DYNO_R-1_C+7": 1483,
  "DYNO_R-1_C+8": 1484,
  "DYNO_R-1_C+9": 1485,
  "DYNO_R-1_C+10": 1486,
  "DYNO_R-1_C+11": 1487,
  "DYNO_R+0_C-11": 1488,
  "DYNO_R+0_C-10": 1489,
  "DYNO_R+0_C-9": 1490,
  "DYNO_R+0_C-8": 1491,
  "DYNO_R+0_C-7": 1492,
  "DYNO_R+0_C-6": 1493,
  "DYNO_R+0_C-5": 1494,
  "DYNO_R+0_C-4": 1495,
  "DYNO_R+0_C-3": 1496,
  "DYNO_R+0_C-2": 1497,
  "DYNO_R+0_C-1": 1498,
  "DYNO_R+0_C+0": 1499,
  "DYNO_R+0_C+1": 1500,
  "DYNO_R+0_C+2": 1501,
  "DYNO_R+0_C+3": 1502,
  "DYNO_R+0_C+4": 1503,
  "DYNO_R+0_C+5": 1504,
  "DYNO_R+0_C+6": 1505,
  "DYNO_R+0_C+7": 1506,
  "DYNO_R+0_C+8": 1507,
  "DYNO_R+0_C+9": 1508,
  "DYNO_R+0_C+10": 1509,
  "DYNO_R+0_C+11": 1510,
  "DYNO_R+1_C-11": 1511,
  "DYNO_R+1_C-10": 1512,
  "DYNO_R+1_C-9": 1513,
  "DYNO_R+1_C-8": 1514,
  "DYNO_R+1_C-7": 1515,
  "DYNO_R+1_C-6": 1516,
  "DYNO_R+1_C-5": 1517,
  "DYNO_R+1_C-4": 1518,
  "DYNO_R+1_C-3": 1519,
  "DYNO_R+1_C-2": 1520,
  "DYNO_R+1_C-1": 1521,
  "DYNO_R+1_C+0": 1522,
  "DYNO_R+1_C+1": 1523,
  "DYNO_R+1_C+2": 1524,
  "DYNO_R+1_C+3": 1525,
  "DYNO_R+1_C+4": 1526,
  "DYNO_R+1_C+5": 1527,
  "DYNO_R+1_C+6": 1528,
  "DYNO_R+1_C+7": 1529,
  "DYNO_R+1_C+8": 1530,
  "DYNO_R+1_C+9": 1531,
  "DYNO_R+1_C+10": 1532,
  "DYNO_R+1_C+11": 1533,
  "DYNO_R+2_C-11": 1534,
  "DYNO_R+2_C-10": 1535,
  "DYNO_R+2_C-9": 1536,
  "DYNO_R+2_C-8": 1537,
  "DYNO_R+2_C-7": 1538,
  "DYNO_R+2_C-6": 1539,
  "DYNO_R+2_C-5": 1540,
  "DYNO_R+2_C-4": 1541,
  "DYNO_R+2_C-3": 1542,
  "DYNO_R+2_C-2": 1543,
  "DYNO_R+2_C-1": 1544,
  "DYNO_R+2_C+0": 1545,
  "DYNO_R+2_C+1": 1546,
  "DYNO_R+2_C+2": 1547,
  "DYNO_R+2_C+3": 1548,
  "DYNO_R+2_C+4": 1549,
  "DYNO_R+2_C+5": 1550,
  "DYNO_R+2_C+6": 1551,
  "DYNO_R+2_C+7": 1552,
  "DYNO_R+2_C+8": 1553,
  "DYNO_R+2_C+9": 1554,
  "DYNO_R+2_C+10": 1555,
  "DYNO_R+2_C+11": 1556,
  "DYNO_R+3_C-11": 1557,
  "DYNO_R+3_C-10": 1558,
  "DYNO_R+3_C-9": 1559,
  "DYNO_R+3_C-8": 1560,
  "DYNO_R+3_C-7": 1561,
  "DYNO_R+3_C-6": 1562,
  "DYNO_R+3_C-5": 1563,
  "DYNO_R+3_C-4": 1564,
  "DYNO_R+3_C-3": 1565,
  "DYNO_R+3_C-2": 1566,
  "DYNO_R+3_C-1": 1567,
  "DYNO_R+3_C+0": 1568,
  "DYNO_R+3_C+1": 1569,
  "DYNO_R+3_C+2": 1570,
  "DYNO_R+3_C+3": 1571,
  "DYNO_R+3_C+4": 1572,
  "DYNO_R+3_C+5": 1573,
  "DYNO_R+3_C+6": 1574,
  "DYNO_R+3_C+7": 1575,
  "DYNO_R+3_C+8": 1576,
  "DYNO_R+3_C+9": 1577,
  "DYNO_R+3_C+10": 1578,
  "DYNO_R+3_C+11": 1579,
  "DYNO_R+4_C-11": 1580,
  "DYNO_R+4_C-10": 1581,
  "DYNO_R+4_C-9": 1582,
  "DYNO_R+4_C-8": 1583,
  "DYNO_R+4_C-7": 1584,
  "DYNO_R+4_C-6": 1585,
  "DYNO_R+4_C-5": 1586,
  "DYNO_R+4_C-4": 1587,
  "DYNO_R+4_C-3": 1588,
  "DYNO_R+4_C-2": 1589,
  "DYNO_R+4_C-1": 1590,
  "DYNO_R+4_C+0": 1591,
  "DYNO_R+4_C+1": 1592,
  "DYNO_R+4_C+2": 1593,
  "DYNO_R+4_C+3": 1594,
  "DYNO_R+4_C+4": 1595,
  "DYNO_R+4_C+5": 1596,
  "DYNO_R+4_C+6": 1597,
  "DYNO_R+4_C+7": 1598,
  "DYNO_R+4_C+8": 1599,
  "DYNO_R+4_C+9": 1600,
  "DYNO_R+4_C+10": 1601,
  "DYNO_R+4_C+11": 1602,
  "DYNO_R+5_C-11": 1603,
  "DYNO_R+5_C-10": 1604,
  "DYNO_R+5_C-9": 1605,
  "DYNO_R+5_C-8": 1606,
  "DYNO_R+5_C-7": 1607,
  "DYNO_R+5_C-6": 1608,
  "DYNO_R+5_C-5": 1609,
  "DYNO_R+5_C-4": 1610,
  "DYNO_R+5_C-3": 1611,
  "DYNO_R+5_C-2": 1612,
  "DYNO_R+5_C-1": 1613,
  "DYNO_R+5_C+0": 1614,
  "DYNO_R+5_C+1": 1615,
  "DYNO_R+5_C+2": 1616,
  "DYNO_R+5_C+3": 1617,
  "DYNO_R+5_C+4": 1618,
  "DYNO_R+5_C+5": 1619,
  "DYNO_R+5_C+6": 1620,
  "DYNO_R+5_C+7": 1621,
  "DYNO_R+5_C+8": 1622,
  "DYNO_R+5_C+9": 1623,
  "DYNO_R+5_C+10": 1624,
  "DYNO_R+5_C+11": 1625,
  "DYNO_R+6_C-11": 1626,
  "DYNO_R+6_C-10": 1627,
  "DYNO_R+6_C-9": 1628,
  "DYNO_R+6_C-8": 1629,
  "DYNO_R+6_C-7": 1630,
  "DYNO_R+6_C-6": 1631,
  "DYNO_R+6_C-5": 1632,
  "DYNO_R+6_C-4": 1633,
  "DYNO_R+6_C-3": 1634,
  "DYNO_R+6_C-2": 1635,
  "DYNO_R+6_C-1": 1636,
  "DYNO_R+6_C+0": 1637,
  "DYNO_R+6_C+1": 1638,
  "DYNO_R+6_C+2": 1639,
  "DYNO_R+6_C+3": 1640,
  "DYNO_R+6_C+4": 1641,
  "DYNO_R+6_C+5": 1642,
  "DYNO_R+6_C+6": 1643,
  "DYNO_R+6_C+7": 1644,
  "DYNO_R+6_C+8": 1645,
  "DYNO_R+6_C+9": 1646,
  "DYNO_R+6_C+10": 1647,
  "DYNO_R+6_C+11": 1648,
  "DYNO_R+7_C-11": 1649,
  "DYNO_R+7_C-10": 1650,
  "DYNO_R+7_C-9": 1651,
  "DYNO_R+7_C-8": 1652,
  "DYNO_R+7_C-7": 1653,
  "DYNO_R+7_C-6": 1654,
  "DYNO_R+7_C-5": 1655,
  "DYNO_R+7_C-4": 1656,
  "DYNO_R+7_C-3": 1657,
  "DYNO_R+7_C-2": 1658,
  "DYNO_R+7_C-1": 1659,
  "DYNO_R+7_C+0": 1660,
  "DYNO_R+7_C+1": 1661,
  "DYNO_R+7_C+2": 1662,
  "DYNO_R+7_C+3": 1663,
  "DYNO_R+7_C+4": 1664,
  "DYNO_R+7_C+5": 1665,
  "DYNO_R+7_C+6": 1666,
  "DYNO_R+7_C+7": 1667,
  "DYNO_R+7_C+8": 1668,
  "DYNO_R+7_C+9": 1669,
  "DYNO_R+7_C+10": 1670,
  "DYNO_R+7_C+11": 1671,
  "DYNO_R+8_C-11": 1672,
  "DYNO_R+8_C-10": 1673,
  "DYNO_R+8_C-9": 1674,
  "DYNO_R+8_C-8": 1675,
  "DYNO_R+8_C-7": 1676,
  "DYNO_R+8_C-6": 1677,
  "DYNO_R+8_C-5": 1678,
  "DYNO_R+8_C-4": 1679,
  "DYNO_R+8_C-3": 1680,
  "DYNO_R+8_C-2": 1681,
  "DYNO_R+8_C-1": 1682,
  "DYNO_R+8_C+0": 1683,
  "DYNO_R+8_C+1": 1684,
  "DYNO_R+8_C+2": 1685,
  "DYNO_R+8_C+3": 1686,
  "DYNO_R+8_C+4": 1687,
  "DYNO_R+8_C+5": 1688,
  "DYNO_R+8_C+6": 1689,
  "DYNO_R+8_C+7": 1690,
  "DYNO_R+8_C+8": 1691,
  "DYNO_R+8_C+9": 1692,
  "DYNO_R+8_C+10": 1693,
  "DYNO_R+8_C+11": 1694,
  "DYNO_R+9_C-11": 1695,
  "DYNO_R+9_C-10": 1696,
  "DYNO_R+9_C-9": 1697,
  "DYNO_R+9_C-8": 1698,
  "DYNO_R+9_C-7": 1699,
  "DYNO_R+9_C-6": 1700,
  "DYNO_R+9_C-5": 1701,
  "DYNO_R+9_C-4": 1702,
  "DYNO_R+9_C-3": 1703,
  "DYNO_R+9_C-2": 1704,
  "DYNO_R+9_C-1": 1705,
  "DYNO_R+9_C+0": 1706,
  "DYNO_R+9_C+1": 1707,
  "DYNO_R+9_C+2": 1708,
  "DYNO_R+9_C+3": 1709,
  "DYNO_R+9_C+4": 1710,
  "DYNO_R+9_C+5": 1711,
  "DYNO_R+9_C+6": 1712,
  "DYNO_R+9_C+7": 1713,
  "DYNO_R+9_C+8": 1714,
  "DYNO_R+9_C+9": 1715,
  "DYNO_R+9_C+10": 1716,
  "DYNO_R+9_C+11": 1717,
  "DYNO_R+10_C-11": 1718,
  "DYNO_R+10_C-10": 1719,
  "DYNO_R+10_C-9": 1720,
  "DYNO_R+10_C-8": 1721,
  "DYNO_R+10_C-7": 1722,
  "DYNO_R+10_C-6": 1723,
  "DYNO_R+10_C-5": 1724,
  "DYNO_R+10_C-4": 1725,
  "DYNO_R+10_C-3": 1726,
  "DYNO_R+10_C-2": 1727,
  "DYNO_R+10_C-1": 1728,
  "DYNO_R+10_C+0": 1729,
  "DYNO_R+10_C+1": 1730,
  "DYNO_R+10_C+2": 1731,
  "DYNO_R+10_C+3": 1732,
  "DYNO_R+10_C+4": 1733,
  "DYNO_R+10_C+5": 1734,
  "DYNO_R+10_C+6": 1735,
  "DYNO_R+10_C+7": 1736,
  "DYNO_R+10_C+8": 1737,
  "DYNO_R+10_C+9": 1738,
  "DYNO_R+10_C+10": 1739,
  "DYNO_R+10_C+11": 1740,
  "DYNO_R+11_C-11": 1741,
  "DYNO_R+11_C-10": 1742,
  "DYNO_R+11_C-9": 1743,
  "DYNO_R+11_C-8": 1744,
  "DYNO_R+11_C-7": 1745,
  "DYNO_R+11_C-6": 1746,
  "DYNO_R+11_C-5": 1747,
  "DYNO_R+11_C-4": 1748,
  "DYNO_R+11_C-3": 1749,
  "DYNO_R+11_C-2": 1750,
  "DYNO_R+11_C-1": 1751,
  "DYNO_R+11_C+0": 1752,
  "DYNO_R+11_C+1": 1753,
  "DYNO_R+11_C+2": 1754,
  "DYNO_R+11_C+3": 1755,
  "DYNO_R+11_C+4": 1756,
  "DYNO_R+11_C+5": 1757,
  "DYNO_R+11_C+6": 1758,
  "DYNO_R+11_C+7": 1759,
  "DYNO_R+11_C+8": 1760,
  "DYNO_R+11_C+9": 1761,
  "DYNO_R+11_C+10": 1762,
  "DYNO_R+11_C+11": 1763,
  "DYNO_R+12_C-11": 1764,
  "DYNO_R+12_C-10": 1765,
  "DYNO_R+12_C-9": 1766,
  "DYNO_R+12_C-8": 1767,
  "DYNO_R+12_C-7": 1768,
  "DYNO_R+12_C-6": 1769,
  "DYNO_R+12_C-5": 1770,
  "DYNO_R+12_C-4": 1771,
  "DYNO_R+12_C-3": 1772,
  "DYNO_R+12_C-2": 1773,
  "DYNO_R+12_C-1": 1774,
  "DYNO_R+12_C+0": 1775,
  "DYNO_R+12_C+1": 1776,
  "DYNO_R+12_C+2": 1777,
  "DYNO_R+12_C+3": 1778,
  "DYNO_R+12_C+4": 1779,
  "DYNO_R+12_C+5": 1780,
  "DYNO_R+12_C+6": 1781,
  "DYNO_R+12_C+7": 1782,
  "DYNO_R+12_C+8": 1783,
  "DYNO_R+12_C+9": 1784,
  "DYNO_R+12_C+10": 1785,
  "DYNO_R+12_C+11": 1786,
  "DYNO_R+13_C-11": 1787,
  "DYNO_R+13_C-10": 1788,
  "DYNO_R+13_C-9": 1789,
  "DYNO_R+13_C-8": 1790,
  "DYNO_R+13_C-7": 1791,
  "DYNO_R+13_C-6": 1792,
  "DYNO_R+13_C-5": 1793,
  "DYNO_R+13_C-4": 1794,
  "DYNO_R+13_C-3": 1795,
  "DYNO_R+13_C-2": 1796,
  "DYNO_R+13_C-1": 1797,
  "DYNO_R+13_C+0": 1798,
  "DYNO_R+13_C+1": 1799,
  "DYNO_R+13_C+2": 1800,
  "DYNO_R+13_C+3": 1801,
  "DYNO_R+13_C+4": 1802,
  "DYNO_R+13_C+5": 1803,
  "DYNO_R+13_C+6": 1804,
  "DYNO_R+13_C+7": 1805,
  "DYNO_R+13_C+8": 1806,
  "DYNO_R+13_C+9": 1807,
  "DYNO_R+13_C+10": 1808,
  "DYNO_R+13_C+11": 1809,
  "DYNO_R+14_C-11": 1810,
  "DYNO_R+14_C-10": 1811,
  "DYNO_R+14_C-9": 1812,
  "DYNO_R+14_C-8": 1813,
  "DYNO_R+14_C-7": 1814,
  "DYNO_R+14_C-6": 1815,
  "DYNO_R+14_C-5": 1816,
  "DYNO_R+14_C-4": 1817,
  "DYNO_R+14_C-3": 1818,
  "DYNO_R+14_C-2": 1819,
  "DYNO_R+14_C-1": 1820,
  "DYNO_R+14_C+0": 1821,
  "DYNO_R+14_C+1": 1822,
  "DYNO_R+14_C+2": 1823,
  "DYNO_R+14_C+3": 1824,
  "DYNO_R+14_C+4": 1825,
  "DYNO_R+14_C+5": 1826,
  "DYNO_R+14_C+6": 1827,
  "DYNO_R+14_C+7": 1828,
  "DYNO_R+14_C+8": 1829,
  "DYNO_R+14_C+9": 1830,
  "DYNO_R+14_C+10": 1831,
  "DYNO_R+14_C+11": 1832,
  "DYNO_R+15_C-11": 1833,
  "DYNO_R+15_C-10": 1834,
  "DYNO_R+15_C-9": 1835,
  "DYNO_R+15_C-8": 1836,
  "DYNO_R+15_C-7": 1837,
  "DYNO_R+15_C-6": 1838,
  "DYNO_R+15_C-5": 1839,
  "DYNO_R+15_C-4": 1840,
  "DYNO_R+15_C-3": 1841,
  "DYNO_R+15_C-2": 1842,
  "DYNO_R+15_C-1": 1843,
  "DYNO_R+15_C+0": 1844,
  "DYNO_R+15_C+1": 1845,
  "DYNO_R+15_C+2": 1846,
  "DYNO_R+15_C+3": 1847,
  "DYNO_R+15_C+4": 1848,
  "DYNO_R+15_C+5": 1849,
  "DYNO_R+15_C+6": 1850,
  "DYNO_R+15_C+7": 1851,
  "DYNO_R+15_C+8": 1852,
  "DYNO_R+15_C+9": 1853,
  "DYNO_R+15_C+10": 1854,
  "DYNO_R+15_C+11": 1855,
  "DYNO_R+16_C-11": 1856,
  "DYNO_R+16_C-10": 1857,
  "DYNO_R+16_C-9": 1858,
  "DYNO_R+16_C-8": 1859,
  "DYNO_R+16_C-7": 1860,
  "DYNO_R+16_C-6": 1861,
  "DYNO_R+16_C-5": 1862,
  "DYNO_R+16_C-4": 1863,
  "DYNO_R+16_C-3": 1864,
  "DYNO_R+16_C-2": 1865,
  "DYNO_R+16_C-1": 1866,
  "DYNO_R+16_C+0": 1867,
  "DYNO_R+16_C+1": 1868,
  "DYNO_R+16_C+2": 1869,
  "DYNO_R+16_C+3": 1870,
  "DYNO_R+16_C+4": 1871,
  "DYNO_R+16_C+5": 1872,
  "DYNO_R+16_C+6": 1873,
  "DYNO_R+16_C+7": 1874,
  "DYNO_R+16_C+8": 1875,
  "DYNO_R+16_C+9": 1876,
  "DYNO_R+16_C+10": 1877,
  "DYNO_R+16_C+11": 1878,
  "DYNO_R+17_C-11": 1879,
  "DYNO_R+17_C-10": 1880,
  "DYNO_R+17_C-9": 1881,
  "DYNO_R+17_C-8": 1882,
  "DYNO_R+17_C-7": 1883,
  "DYNO_R+17_C-6": 1884,
  "DYNO_R+17_C-5": 1885,
  "DYNO_R+17_C-4": 1886,
  "DYNO_R+17_C-3": 1887,
  "DYNO_R+17_C-2": 1888,
  "DYNO_R+17_C-1": 1889,
  "DYNO_R+17_C+0": 1890,
  "DYNO_R+17_C+1": 1891,
  "DYNO_R+17_C+2": 1892,
  "DYNO_R+17_C+3": 1893,
  "DYNO_R+17_C+4": 1894,
  "DYNO_R+17_C+5": 1895,
  "DYNO_R+17_C+6": 1896,
  "DYNO_R+17_C+7": 1897,
  "DYNO_R+17_C+8": 1898,
  "DYNO_R+17_C+9": 1899,
  "DYNO_R+17_C+10": 1900,
  "DYNO_R+17_C+11": 1901,
  "DYNO_R+18_C-11": 1902,
  "DYNO_R+18_C-10": 1903,
  "DYNO_R+18_C-9": 1904,
  "DYNO_R+18_C-8": 1905,
  "DYNO_R+18_C-7": 1906,
  "DYNO_R+18_C-6": 1907,
  "DYNO_R+18_C-5": 1908,
  "DYNO_R+18_C-4": 1909,
  "DYNO_R+18_C-3": 1910,
  "DYNO_R+18_C-2": 1911,
  "DYNO_R+18_C-1": 1912,
  "DYNO_R+18_C+0": 1913,
  "DYNO_R+18_C+1": 1914,
  "DYNO_R+18_C+2": 1915,
  "DYNO_R+18_C+3": 1916,
  "DYNO_R+18_C+4": 1917,
  "DYNO_R+18_C+5": 1918,
  "DYNO_R+18_C+6": 1919,
  "DYNO_R+18_C+7": 1920,
  "DYNO_R+18_C+8": 1921,
  "DYNO_R+18_C+9": 1922,
  "DYNO_R+18_C+10": 1923,
  "DYNO_R+18_C+11": 1924,
  "LOCK_R-18_C-11": 1925,
  "LOCK_R-18_C-10": 1926,
  "LOCK_R-18_C-9": 1927,
  "LOCK_R-18_C-8": 1928,
  "LOCK_R-18_C-7": 1929,
  "LOCK_R-18_C-6": 1930,
  "LOCK_R-18_C-5": 1931,
  "LOCK_R-18_C-4": 1932,
  "LOCK_R-18_C-3": 1933,
  "LOCK_R-18_C-2": 1934,
  "LOCK_R-18_C-1": 1935,
  "LOCK_R-18_C+0": 1936,
  "LOCK_R-18_C+1": 1937,
  "LOCK_R-18_C+2": 1938,
  "LOCK_R-18_C+3": 1939,
  "LOCK_R-18_C+4": 1940,
  "LOCK_R-18_C+5": 1941,
  "LOCK_R-18_C+6": 1942,
  "LOCK_R-18_C+7": 1943,
  "LOCK_R-18_C+8": 1944,
  "LOCK_R-18_C+9": 1945,
  "LOCK_R-18_C+10": 1946,
  "LOCK_R-18_C+11": 1947,
  "LOCK_R-17_C-11": 1948,
  "LOCK_R-17_C-10": 1949,
  "LOCK_R-17_C-9": 1950,
  "LOCK_R-17_C-8": 1951,
  "LOCK_R-17_C-7": 1952,
  "LOCK_R-17_C-6": 1953,
  "LOCK_R-17_C-5": 1954,
  "LOCK_R-17_C-4": 1955,
  "LOCK_R-17_C-3": 1956,
  "LOCK_R-17_C-2": 1957,
  "LOCK_R-17_C-1": 1958,
  "LOCK_R-17_C+0": 1959,
  "LOCK_R-17_C+1": 1960,
  "LOCK_R-17_C+2": 1961,
  "LOCK_R-17_C+3": 1962,
  "LOCK_R-17_C+4": 1963,
  "LOCK_R-17_C+5": 1964,
  "LOCK_R-17_C+6": 1965,
  "LOCK_R-17_C+7": 1966,
  "LOCK_R-17_C+8": 1967,
  "LOCK_R-17_C+9": 1968,
  "LOCK_R-17_C+10": 1969,
  "LOCK_R-17_C+11": 1970,
  "LOCK_R-16_C-11": 1971,
  "LOCK_R-16_C-10": 1972,
  "LOCK_R-16_C-9": 1973,
  "LOCK_R-16_C-8": 1974,
  "LOCK_R-16_C-7": 1975,
  "LOCK_R-16_C-6": 1976,
  "LOCK_R-16_C-5": 1977,
  "LOCK_R-16_C-4": 1978,
  "LOCK_R-16_C-3": 1979,
  "LOCK_R-16_C-2": 1980,
  "LOCK_R-16_C-1": 1981,
  "LOCK_R-16_C+0": 1982,
  "LOCK_R-16_C+1": 1983,
  "LOCK_R-16_C+2": 1984,
  "LOCK_R-16_C+3": 1985,
  "LOCK_R-16_C+4": 1986,
  "LOCK_R-16_C+5": 1987,
  "LOCK_R-16_C+6": 1988,
  "LOCK_R-16_C+7": 1989,
  "LOCK_R-16_C+8": 1990,
  "LOCK_R-16_C+9": 1991,
  "LOCK_R-16_C+10": 1992,
  "LOCK_R-16_C+11": 1993,
  "LOCK_R-15_C-11": 1994,
  "LOCK_R-15_C-10": 1995,
  "LOCK_R-15_C-9": 1996,
  "LOCK_R-15_C-8": 1997,
  "LOCK_R-15_C-7": 1998,
  "LOCK_R-15_C-6": 1999,
  "LOCK_R-15_C-5": 2000,
  "LOCK_R-15_C-4": 2001,
  "LOCK_R-15_C-3": 2002,
  "LOCK_R-15_C-2": 2003,
  "LOCK_R-15_C-1": 2004,
  "LOCK_R-15_C+0": 2005,
  "LOCK_R-15_C+1": 2006,
  "LOCK_R-15_C+2": 2007,
  "LOCK_R-15_C+3": 2008,
  "LOCK_R-15_C+4": 2009,
  "LOCK_R-15_C+5": 2010,
  "LOCK_R-15_C+6": 2011,
  "LOCK_R-15_C+7": 2012,
  "LOCK_R-15_C+8": 2013,
  "LOCK_R-15_C+9": 2014,
  "LOCK_R-15_C+10": 2015,
  "LOCK_R-15_C+11": 2016,
  "LOCK_R-14_C-11": 2017,
  "LOCK_R-14_C-10": 2018,
  "LOCK_R-14_C-9": 2019,
  "LOCK_R-14_C-8": 2020,
  "LOCK_R-14_C-7": 2021,
  "LOCK_R-14_C-6": 2022,
  "LOCK_R-14_C-5": 2023,
  "LOCK_R-14_C-4": 2024,
  "LOCK_R-14_C-3": 2025,
  "LOCK_R-14_C-2": 2026,
  "LOCK_R-14_C-1": 2027,
  "LOCK_R-14_C+0": 2028,
  "LOCK_R-14_C+1": 2029,
  "LOCK_R-14_C+2": 2030,
  "LOCK_R-14_C+3": 2031,
  "LOCK_R-14_C+4": 2032,
  "LOCK_R-14_C+5": 2033,
  "LOCK_R-14_C+6": 2034,
  "LOCK_R-14_C+7": 2035,
  "LOCK_R-14_C+8": 2036,
  "LOCK_R-14_C+9": 2037,
  "LOCK_R-14_C+10": 2038,
  "LOCK_R-14_C+11": 2039,
  "LOCK_R-13_C-11": 2040,
  "LOCK_R-13_C-10": 2041,
  "LOCK_R-13_C-9": 2042,
  "LOCK_R-13_C-8": 2043,
  "LOCK_R-13_C-7": 2044,
  "LOCK_R-13_C-6": 2045,
  "LOCK_R-13_C-5": 2046,
  "LOCK_R-13_C-4": 2047,
  "LOCK_R-13_C-3": 2048,
  "LOCK_R-13_C-2": 2049,
  "LOCK_R-13_C-1": 2050,
  "LOCK_R-13_C+0": 2051,
  "LOCK_R-13_C+1": 2052,
  "LOCK_R-13_C+2": 2053,
  "LOCK_R-13_C+3": 2054,
  "LOCK_R-13_C+4": 2055,
  "LOCK_R-13_C+5": 2056,
  "LOCK_R-13_C+6": 2057,
  "LOCK_R-13_C+7": 2058,
  "LOCK_R-13_C+8": 2059,
  "LOCK_R-13_C+9": 2060,
  "LOCK_R-13_C+10": 2061,
  "LOCK_R-13_C+11": 2062,
  "LOCK_R-12_C-11": 2063,
  "LOCK_R-12_C-10": 2064,
  "LOCK_R-12_C-9": 2065,
  "LOCK_R-12_C-8": 2066,
  "LOCK_R-12_C-7": 2067,
  "LOCK_R-12_C-6": 2068,
  "LOCK_R-12_C-5": 2069,
  "LOCK_R-12_C-4": 2070,
  "LOCK_R-12_C-3": 2071,
  "LOCK_R-12_C-2": 2072,
  "LOCK_R-12_C-1": 2073,
  "LOCK_R-12_C+0": 2074,
  "LOCK_R-12_C+1": 2075,
  "LOCK_R-12_C+2": 2076,
  "LOCK_R-12_C+3": 2077,
  "LOCK_R-12_C+4": 2078,
  "LOCK_R-12_C+5": 2079,
  "LOCK_R-12_C+6": 2080,
  "LOCK_R-12_C+7": 2081,
  "LOCK_R-12_C+8": 2082,
  "LOCK_R-12_C+9": 2083,
  "LOCK_R-12_C+10": 2084,
  "LOCK_R-12_C+11": 2085,
  "LOCK_R-11_C-11": 2086,
  "LOCK_R-11_C-10": 2087,
  "LOCK_R-11_C-9": 2088,
  "LOCK_R-11_C-8": 2089,
  "LOCK_R-11_C-7": 2090,
  "LOCK_R-11_C-6": 2091,
  "LOCK_R-11_C-5": 2092,
  "LOCK_R-11_C-4": 2093,
  "LOCK_R-11_C-3": 2094,
  "LOCK_R-11_C-2": 2095,
  "LOCK_R-11_C-1": 2096,
  "LOCK_R-11_C+0": 2097,
  "LOCK_R-11_C+1": 2098,
  "LOCK_R-11_C+2": 2099,
  "LOCK_R-11_C+3": 2100,
  "LOCK_R-11_C+4": 2101,
